iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint32_t MMR0;
  uint32_t MAM0;
  uint32_t MID0;
  uint32_t MFID0;
  uint32_t MSR0;
  uint32_t MDL0;
  uint32_t MDH0;
  uint32_t MCR0;
  uint32_t MMR1;
  uint32_t MAM1;
  uint32_t MID1;
  uint32_t MFID1;
  uint32_t MSR1;
  uint32_t MDL1;
  uint32_t MDH1;
  uint32_t MCR1;
  uint32_t MMR2;
  uint32_t MAM2;
  uint32_t MID2;
  uint32_t MFID2;
  uint32_t MSR2;
  uint32_t MDL2;
  uint32_t MDH2;
  uint32_t MCR2;
  uint32_t MMR3;
  uint32_t MAM3;
  uint32_t MID3;
  uint32_t MFID3;
  uint32_t MSR3;
  uint32_t MDL3;
  uint32_t MDH3;
  uint32_t MCR3;
  uint32_t MMR4;
  uint32_t MAM4;
  uint32_t MID4;
  uint32_t MFID4;
  uint32_t MSR4;
  uint32_t MDL4;
  uint32_t MDH4;
  uint32_t MCR4;
  uint32_t MMR5;
  uint32_t MAM5;
  uint32_t MID5;
  uint32_t MFID5;
  uint32_t MSR5;
  uint32_t MDL5;
  uint32_t MDH5;
  uint32_t MCR5;
  uint32_t MMR6;
  uint32_t MAM6;
  uint32_t MID6;
  uint32_t MFID6;
  uint32_t MSR6;
  uint32_t MDL6;
  uint32_t MDH6;
  uint32_t MCR6;
  uint32_t MMR7;
  uint32_t MAM7;
  uint32_t MID7;
  uint32_t MFID7;
  uint32_t MSR7;
  uint32_t MDL7;
  uint32_t MDH7;
  uint32_t MCR7;
};

#define CAN_CAN1_0 (*(volatile struct CAN_CAN1_0_tag *) 0xf8010000)

struct DBGU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSTRX:1;
      uint64_t RSTTX:1;
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RSTSTA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t PAR:3;
      uint64_t reservedSpace1:2;
      uint64_t CHMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:20;
      uint64_t COMMTX:1;
      uint64_t COMMRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:20;
      uint64_t COMMTX:1;
      uint64_t COMMRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:20;
      uint64_t COMMTX:1;
      uint64_t COMMRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:20;
      uint64_t COMMTX:1;
      uint64_t COMMRX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRGR;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERSION:5;
      uint64_t EPROC:3;
      uint64_t NVPSIZ:4;
      uint64_t NVPSIZ2:4;
      uint64_t SRAMSIZ:4;
      uint64_t ARCH:8;
      uint64_t NVPTYP:3;
      uint64_t EXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FNTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNR;

};

#define DBGU_0 (*(volatile struct DBGU_0_tag *) 0xffffee00)

struct DMAC_DMAC0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ARB_CFG:1;
      uint64_t reservedSpace1:3;
      uint64_t DICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSREQ0:1;
      uint64_t DSREQ0:1;
      uint64_t SSREQ1:1;
      uint64_t DSREQ1:1;
      uint64_t SSREQ2:1;
      uint64_t DSREQ2:1;
      uint64_t SSREQ3:1;
      uint64_t DSREQ3:1;
      uint64_t SSREQ4:1;
      uint64_t DSREQ4:1;
      uint64_t SSREQ5:1;
      uint64_t DSREQ5:1;
      uint64_t SSREQ6:1;
      uint64_t DSREQ6:1;
      uint64_t SSREQ7:1;
      uint64_t DSREQ7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCREQ0:1;
      uint64_t DCREQ0:1;
      uint64_t SCREQ1:1;
      uint64_t DCREQ1:1;
      uint64_t SCREQ2:1;
      uint64_t DCREQ2:1;
      uint64_t SCREQ3:1;
      uint64_t DCREQ3:1;
      uint64_t SCREQ4:1;
      uint64_t DCREQ4:1;
      uint64_t SCREQ5:1;
      uint64_t DCREQ5:1;
      uint64_t SCREQ6:1;
      uint64_t DCREQ6:1;
      uint64_t SCREQ7:1;
      uint64_t DCREQ7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLAST0:1;
      uint64_t DLAST0:1;
      uint64_t SLAST1:1;
      uint64_t DLAST1:1;
      uint64_t SLAST2:1;
      uint64_t DLAST2:1;
      uint64_t SLAST3:1;
      uint64_t DLAST3:1;
      uint64_t SLAST4:1;
      uint64_t DLAST4:1;
      uint64_t SLAST5:1;
      uint64_t DLAST5:1;
      uint64_t SLAST6:1;
      uint64_t DLAST6:1;
      uint64_t SLAST7:1;
      uint64_t DLAST7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LAST;

