iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint32_t SADDR3;
  uint32_t DADDR3;
  uint32_t DSCR3;
  uint32_t CTRLA3;
  uint32_t CTRLB3;
  uint32_t CFG3;
  uint32_t SPIP3;
  uint32_t DPIP3;
  uint8_t res5[8];

  uint32_t SADDR4;
  uint32_t DADDR4;
  uint32_t DSCR4;
  uint32_t CTRLA4;
  uint32_t CTRLB4;
  uint32_t CFG4;
  uint32_t SPIP4;
  uint32_t DPIP4;
  uint8_t res6[8];

  uint32_t SADDR5;
  uint32_t DADDR5;
  uint32_t DSCR5;
  uint32_t CTRLA5;
  uint32_t CTRLB5;
  uint32_t CFG5;
  uint32_t SPIP5;
  uint32_t DPIP5;
  uint8_t res7[8];

  uint32_t SADDR6;
  uint32_t DADDR6;
  uint32_t DSCR6;
  uint32_t CTRLA6;
  uint32_t CTRLB6;
  uint32_t CFG6;
  uint32_t SPIP6;
  uint32_t DPIP6;
  uint8_t res8[8];

  uint32_t SADDR7;
  uint32_t DADDR7;
  uint32_t DSCR7;
  uint32_t CTRLA7;
  uint32_t CTRLB7;
  uint32_t CFG7;
  uint32_t SPIP7;
  uint32_t DPIP7;
  uint8_t res9[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

};

#define DMAC_DMAC0_0 (*(volatile struct DMAC_DMAC0_0_tag *) 0xffffe600)

struct DMAC_DMAC1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ARB_CFG:1;
      uint64_t reservedSpace1:3;
      uint64_t DICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSREQ0:1;
      uint64_t DSREQ0:1;
      uint64_t SSREQ1:1;
      uint64_t DSREQ1:1;
      uint64_t SSREQ2:1;
      uint64_t DSREQ2:1;
      uint64_t SSREQ3:1;
      uint64_t DSREQ3:1;
      uint64_t SSREQ4:1;
      uint64_t DSREQ4:1;
      uint64_t SSREQ5:1;
      uint64_t DSREQ5:1;
      uint64_t SSREQ6:1;
      uint64_t DSREQ6:1;
      uint64_t SSREQ7:1;
      uint64_t DSREQ7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCREQ0:1;
      uint64_t DCREQ0:1;
      uint64_t SCREQ1:1;
      uint64_t DCREQ1:1;
      uint64_t SCREQ2:1;
      uint64_t DCREQ2:1;
      uint64_t SCREQ3:1;
      uint64_t DCREQ3:1;
      uint64_t SCREQ4:1;
      uint64_t DCREQ4:1;
      uint64_t SCREQ5:1;
      uint64_t DCREQ5:1;
      uint64_t SCREQ6:1;
      uint64_t DCREQ6:1;
      uint64_t SCREQ7:1;
      uint64_t DCREQ7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLAST0:1;
      uint64_t DLAST0:1;
      uint64_t SLAST1:1;
      uint64_t DLAST1:1;
      uint64_t SLAST2:1;
      uint64_t DLAST2:1;
      uint64_t SLAST3:1;
      uint64_t DLAST3:1;
      uint64_t SLAST4:1;
      uint64_t DLAST4:1;
      uint64_t SLAST5:1;
      uint64_t DLAST5:1;
      uint64_t SLAST6:1;
      uint64_t DLAST6:1;
      uint64_t SLAST7:1;
      uint64_t DLAST7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LAST;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t ENA6:1;
      uint64_t ENA7:1;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t SUSP6:1;
      uint64_t SUSP7:1;
      uint64_t reservedSpace0:8;
      uint64_t KEEP0:1;
      uint64_t KEEP1:1;
      uint64_t KEEP2:1;
      uint64_t KEEP3:1;
      uint64_t KEEP4:1;
      uint64_t KEEP5:1;
      uint64_t KEEP6:1;
      uint64_t KEEP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS0:1;
      uint64_t DIS1:1;
      uint64_t DIS2:1;
      uint64_t DIS3:1;
      uint64_t DIS4:1;
      uint64_t DIS5:1;
      uint64_t DIS6:1;
      uint64_t DIS7:1;
      uint64_t RES0:1;
      uint64_t RES1:1;
      uint64_t RES2:1;
      uint64_t RES3:1;
      uint64_t RES4:1;
      uint64_t RES5:1;
      uint64_t RES6:1;
      uint64_t RES7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t ENA6:1;
      uint64_t ENA7:1;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t SUSP6:1;
      uint64_t SUSP7:1;
      uint64_t EMPT0:1;
      uint64_t EMPT1:1;
      uint64_t EMPT2:1;
      uint64_t EMPT3:1;
      uint64_t EMPT4:1;
      uint64_t EMPT5:1;
      uint64_t EMPT6:1;
      uint64_t EMPT7:1;
      uint64_t STAL0:1;
      uint64_t STAL1:1;
      uint64_t STAL2:1;
      uint64_t STAL3:1;
      uint64_t STAL4:1;
      uint64_t STAL5:1;
      uint64_t STAL6:1;
      uint64_t STAL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR;

