iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAB4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIDM;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IP:16;
      uint64_t MAG:1;
      uint64_t ARP:1;
      uint64_t SA1:1;
      uint64_t MTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLAN_TYPE:16;
      uint64_t reservedSpace0:15;
      uint64_t ESVLAN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SVLAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEV:8;
      uint64_t PQ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPFCP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAMT1;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFTX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFT64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFT127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFT255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFT511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFT1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFT1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTBFT1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCOL:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCOL:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XCOL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCOL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEFT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ORLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ORHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFRX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFR127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFR255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFR511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFR1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBFR1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMXBFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCKR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFFE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRER:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IHCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UCE;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTN:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSSN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TNS:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITDT:30;
      uint64_t reservedSpace0:1;
      uint64_t ADJ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNS:8;
      uint64_t ACNS:8;
      uint64_t NIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFTN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFRN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEFTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEFTN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEFRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEFRN;

  uint8_t res4[512];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t reservedSpace1:2;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace2:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISRPQ;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TXBQBA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBQBAPQ;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RXBQBA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBQBAPQ;

  uint8_t res7[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RBS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBSRPQ;

  uint8_t res8[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QNB:4;
      uint64_t DSTCM:8;
      uint64_t UDPM:16;
      uint64_t DSTCE:1;
      uint64_t UDPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST1RPQ;

