iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res9[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QNB:4;
      uint64_t VLANP:4;
      uint64_t VLANE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ST2RPQ;

  uint8_t res10[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t reservedSpace1:2;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace2:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IERPQ;

  uint8_t res11[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t reservedSpace1:2;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace2:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDRPQ;

  uint8_t res12[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t reservedSpace1:2;
      uint64_t RLEX:1;
      uint64_t AHB:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace2:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMRPQ;

};

#define GMAC_0 (*(volatile struct GMAC_0_tag *) 0xf0028000)

struct GPBR_0_tag
{
  uint32_t GPBR;
};

#define GPBR_0 (*(volatile struct GPBR_0_tag *) 0xfffffe60)

struct HSMCI_HSMCI0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCIEN:1;
      uint64_t MCIDIS:1;
      uint64_t PWSEN:1;
      uint64_t PWSDIS:1;
      uint64_t reservedSpace0:3;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:8;
      uint64_t PWSDIV:3;
      uint64_t RDPROOF:1;
      uint64_t WRPROOF:1;
      uint64_t FBYTE:1;
      uint64_t PADV:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKODD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCYC:4;
      uint64_t DTOMUL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDCSEL:2;
      uint64_t reservedSpace0:4;
      uint64_t SDCBUS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDNB:6;
      uint64_t RSPTYP:2;
      uint64_t SPCMD:3;
      uint64_t OPDCMD:1;
      uint64_t MAXLAT:1;
      uint64_t reservedSpace0:3;
      uint64_t TRCMD:2;
      uint64_t TRDIR:1;
      uint64_t TRTYP:3;
      uint64_t reservedSpace1:2;
      uint64_t IOSPCMD:2;
      uint64_t ATACS:1;
      uint64_t BOOT_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCNT:16;
      uint64_t BLKLEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTOCYC:4;
      uint64_t CSTOMUL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSPR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace1:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t reservedSpace2:2;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t BLKOVRE:1;
      uint64_t DMADONE:1;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace1:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t reservedSpace2:2;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t BLKOVRE:1;
      uint64_t DMADONE:1;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace1:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t reservedSpace2:2;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t BLKOVRE:1;
      uint64_t DMADONE:1;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t BLKE:1;
      uint64_t DTIP:1;
      uint64_t NOTBUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t SDIOIRQA:1;
      uint64_t reservedSpace1:3;
      uint64_t SDIOWAIT:1;
      uint64_t CSRCV:1;
      uint64_t reservedSpace2:2;
      uint64_t RINDE:1;
      uint64_t RDIRE:1;
      uint64_t RCRCE:1;
      uint64_t RENDE:1;
      uint64_t RTOE:1;
      uint64_t DCRCE:1;
      uint64_t DTOE:1;
      uint64_t CSTOE:1;
      uint64_t BLKOVRE:1;
      uint64_t DMADONE:1;
      uint64_t FIFOEMPTY:1;
      uint64_t XFRDONE:1;
      uint64_t ACKRCV:1;
      uint64_t ACKRCVE:1;
      uint64_t OVRE:1;
      uint64_t UNRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:2;
      uint64_t reservedSpace0:2;
      uint64_t CHKSIZE:3;
      uint64_t reservedSpace1:1;
      uint64_t DMAEN:1;
      uint64_t reservedSpace2:3;
      uint64_t ROPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t FERRCTRL:1;
      uint64_t reservedSpace1:3;
      uint64_t HSMODE:1;
      uint64_t reservedSpace2:3;
      uint64_t LSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res2[140];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t WP_KEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP_VS:4;
      uint64_t reservedSpace0:4;
      uint64_t WP_VSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

  uint8_t res3[276];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

