iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
};

#define HSMCI_HSMCI2_0 (*(volatile struct HSMCI_HSMCI2_0_tag *) 0xf8004000)

struct ISI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HSYNC_POL:1;
      uint64_t VSYNC_POL:1;
      uint64_t PIXCLK_POL:1;
      uint64_t reservedSpace1:1;
      uint64_t EMB_SYNC:1;
      uint64_t CRC_SYNC:1;
      uint64_t FRATE:3;
      uint64_t DISCR:1;
      uint64_t FULL:1;
      uint64_t THMASK:2;
      uint64_t reservedSpace2:1;
      uint64_t SLD:8;
      uint64_t SFD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM_VSIZE:11;
      uint64_t GS_MODE:1;
      uint64_t RGB_MODE:1;
      uint64_t GRAYSCALE:1;
      uint64_t RGB_SWAP:1;
      uint64_t COL_SPACE:1;
      uint64_t IM_HSIZE:11;
      uint64_t reservedSpace0:1;
      uint64_t YCC_SWAP:2;
      uint64_t RGB_CFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREV_VSIZE:10;
      uint64_t reservedSpace0:6;
      uint64_t PREV_HSIZE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEC_FACTOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDECF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C0:8;
      uint64_t C1:8;
      uint64_t C2:8;
      uint64_t C3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Y2R_SET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C4:9;
      uint64_t reservedSpace0:3;
      uint64_t Yoff:1;
      uint64_t Croff:1;
      uint64_t Cboff:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Y2R_SET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C0:7;
      uint64_t reservedSpace0:1;
      uint64_t C1:7;
      uint64_t reservedSpace1:1;
      uint64_t C2:7;
      uint64_t reservedSpace2:1;
      uint64_t Roff:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R2Y_SET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C3:7;
      uint64_t reservedSpace0:1;
      uint64_t C4:7;
      uint64_t reservedSpace1:1;
      uint64_t C5:7;
      uint64_t reservedSpace2:1;
      uint64_t Goff:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R2Y_SET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C6:7;
      uint64_t reservedSpace0:1;
      uint64_t C7:7;
      uint64_t reservedSpace1:1;
      uint64_t C8:7;
      uint64_t reservedSpace2:1;
      uint64_t Boff:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R2Y_SET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISI_EN:1;
      uint64_t ISI_DIS:1;
      uint64_t ISI_SRST:1;
      uint64_t reservedSpace0:5;
      uint64_t ISI_CDC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t DIS_DONE:1;
      uint64_t SRST:1;
      uint64_t reservedSpace0:5;
      uint64_t CDC_PND:1;
      uint64_t reservedSpace1:1;
      uint64_t VSYNC:1;
      uint64_t reservedSpace2:5;
      uint64_t PXFR_DONE:1;
      uint64_t CXFR_DONE:1;
      uint64_t reservedSpace3:1;
      uint64_t SIP:1;
      uint64_t reservedSpace4:4;
      uint64_t P_OVR:1;
      uint64_t C_OVR:1;
      uint64_t CRC_ERR:1;
      uint64_t FR_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DIS_DONE:1;
      uint64_t SRST:1;
      uint64_t reservedSpace1:7;
      uint64_t VSYNC:1;
      uint64_t reservedSpace2:5;
      uint64_t PXFR_DONE:1;
      uint64_t CXFR_DONE:1;
      uint64_t reservedSpace3:6;
      uint64_t P_OVR:1;
      uint64_t C_OVR:1;
      uint64_t CRC_ERR:1;
      uint64_t FR_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DIS_DONE:1;
      uint64_t SRST:1;
      uint64_t reservedSpace1:7;
      uint64_t VSYNC:1;
      uint64_t reservedSpace2:5;
      uint64_t PXFR_DONE:1;
      uint64_t CXFR_DONE:1;
      uint64_t reservedSpace3:6;
      uint64_t P_OVR:1;
      uint64_t C_OVR:1;
      uint64_t CRC_ERR:1;
      uint64_t FR_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DIS_DONE:1;
      uint64_t SRST:1;
      uint64_t reservedSpace1:7;
      uint64_t VSYNC:1;
      uint64_t reservedSpace2:5;
      uint64_t PXFR_DONE:1;
      uint64_t CXFR_DONE:1;
      uint64_t reservedSpace3:6;
      uint64_t P_OVR:1;
      uint64_t C_OVR:1;
      uint64_t CRC_ERR:1;
      uint64_t FR_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P_CH_EN:1;
      uint64_t C_CH_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P_CH_DIS:1;
      uint64_t C_CH_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P_CH_S:1;
      uint64_t C_CH_S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t P_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_P_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P_FETCH:1;
      uint64_t P_WB:1;
      uint64_t P_IEN:1;
      uint64_t P_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_P_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t P_DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_P_DSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t C_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_C_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C_FETCH:1;
      uint64_t C_WB:1;
      uint64_t C_IEN:1;
      uint64_t C_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_C_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t C_DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_C_DSCR;

  uint8_t res0[136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t WP_KEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP_VS:4;
      uint64_t reservedSpace0:4;
      uint64_t WP_VSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

