iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t YSIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XMEM_SIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t YMEM_SIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UVXSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UVPSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDEF:8;
      uint64_t GDEF:8;
      uint64_t RDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKEY:8;
      uint64_t GKEY:8;
      uint64_t RKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMASK:8;
      uint64_t GMASK:8;
      uint64_t RMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRKEY:1;
      uint64_t INV:1;
      uint64_t ITER2BL:1;
      uint64_t ITER:1;
      uint64_t REVALPHA:1;
      uint64_t GAEN:1;
      uint64_t LAEN:1;
      uint64_t OVR:1;
      uint64_t DMA:1;
      uint64_t REP:1;
      uint64_t DSTKEY:1;
      uint64_t reservedSpace0:1;
      uint64_t VIDPRI:1;
      uint64_t reservedSpace1:3;
      uint64_t GA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFACTOR:14;
      uint64_t reservedSpace0:2;
      uint64_t YFACTOR:14;
      uint64_t reservedSpace1:1;
      uint64_t SCALEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCRY:10;
      uint64_t CSCRU:10;
      uint64_t CSCRV:10;
      uint64_t CSCYOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCGY:10;
      uint64_t CSCGU:10;
      uint64_t CSCGV:10;
      uint64_t CSCUOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCBY:10;
      uint64_t CSCBU:10;
      uint64_t CSCBV:10;
      uint64_t CSCVOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI0COEFF0:8;
      uint64_t XPHI0COEFF1:8;
      uint64_t XPHI0COEFF2:8;
      uint64_t XPHI0COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI0COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI1COEFF0:8;
      uint64_t XPHI1COEFF1:8;
      uint64_t XPHI1COEFF2:8;
      uint64_t XPHI1COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI1COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI2COEFF0:8;
      uint64_t XPHI2COEFF1:8;
      uint64_t XPHI2COEFF2:8;
      uint64_t XPHI2COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI2COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI3COEFF0:8;
      uint64_t XPHI3COEFF1:8;
      uint64_t XPHI3COEFF2:8;
      uint64_t XPHI3COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI3COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI4COEFF0:8;
      uint64_t XPHI4COEFF1:8;
      uint64_t XPHI4COEFF2:8;
      uint64_t XPHI4COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI4COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI5COEFF0:8;
      uint64_t XPHI5COEFF1:8;
      uint64_t XPHI5COEFF2:8;
      uint64_t XPHI5COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI5COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI6COEFF0:8;
      uint64_t XPHI6COEFF1:8;
      uint64_t XPHI6COEFF2:8;
      uint64_t XPHI6COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI6COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI7COEFF0:8;
      uint64_t XPHI7COEFF1:8;
      uint64_t XPHI7COEFF2:8;
      uint64_t XPHI7COEFF3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHI7COEFF4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI0COEFF0:8;
      uint64_t YPHI0COEFF1:8;
      uint64_t YPHI0COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI1COEFF0:8;
      uint64_t YPHI1COEFF1:8;
      uint64_t YPHI1COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI2COEFF0:8;
      uint64_t YPHI2COEFF1:8;
      uint64_t YPHI2COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI3COEFF0:8;
      uint64_t YPHI3COEFF1:8;
      uint64_t YPHI3COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI4COEFF0:8;
      uint64_t YPHI4COEFF1:8;
      uint64_t YPHI4COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI5COEFF0:8;
      uint64_t YPHI5COEFF1:8;
      uint64_t YPHI5COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI6COEFF0:8;
      uint64_t YPHI6COEFF1:8;
      uint64_t YPHI6COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPHI7COEFF0:8;
      uint64_t YPHI7COEFF1:8;
      uint64_t YPHI7COEFF2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPHIDEF:3;
      uint64_t reservedSpace0:13;
      uint64_t YPHIDEF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG41;

