iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBS:1;
      uint64_t reservedSpace0:7;
      uint64_t USBDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMDS:1;
      uint64_t reservedSpace0:7;
      uint64_t SMDDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:3;
      uint64_t reservedSpace0:1;
      uint64_t PRES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCK;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t reservedSpace2:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t reservedSpace3:6;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t reservedSpace2:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t reservedSpace3:6;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:2;
      uint64_t LOCKU:1;
      uint64_t OSCSELS:1;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t reservedSpace2:6;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
      uint64_t CFDS:1;
      uint64_t FOS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTS:1;
      uint64_t LOCKA:1;
      uint64_t reservedSpace0:1;
      uint64_t MCKRDY:1;
      uint64_t reservedSpace1:4;
      uint64_t PCKRDY0:1;
      uint64_t PCKRDY1:1;
      uint64_t reservedSpace2:6;
      uint64_t MOSCSELS:1;
      uint64_t MOSCRCS:1;
      uint64_t CFDEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICPLLA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLICPR;

  uint8_t res5[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
      uint64_t PID45:1;
      uint64_t PID46:1;
      uint64_t PID47:1;
      uint64_t PID48:1;
      uint64_t PID49:1;
      uint64_t PID50:1;
      uint64_t PID51:1;
      uint64_t PID53:2;
      uint64_t PID54:1;
      uint64_t PID55:1;
      uint64_t PID56:1;
      uint64_t PID57:1;
      uint64_t PID58:1;
      uint64_t PID59:1;
      uint64_t PID60:1;
      uint64_t PID61:1;
      uint64_t PID62:1;
      uint64_t PID63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
      uint64_t PID45:1;
      uint64_t PID46:1;
      uint64_t PID47:1;
      uint64_t PID48:1;
      uint64_t PID49:1;
      uint64_t PID50:1;
      uint64_t PID51:1;
      uint64_t PID53:2;
      uint64_t PID54:1;
      uint64_t PID55:1;
      uint64_t PID56:1;
      uint64_t PID57:1;
      uint64_t PID58:1;
      uint64_t PID59:1;
      uint64_t PID60:1;
      uint64_t PID61:1;
      uint64_t PID62:1;
      uint64_t PID63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
      uint64_t PID45:1;
      uint64_t PID46:1;
      uint64_t PID47:1;
      uint64_t PID48:1;
      uint64_t PID49:1;
      uint64_t PID50:1;
      uint64_t PID51:1;
      uint64_t PID53:2;
      uint64_t PID54:1;
      uint64_t PID55:1;
      uint64_t PID56:1;
      uint64_t PID57:1;
      uint64_t PID58:1;
      uint64_t PID59:1;
      uint64_t PID60:1;
      uint64_t PID61:1;
      uint64_t PID62:1;
      uint64_t PID63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:6;
      uint64_t CMD:1;
      uint64_t reservedSpace1:3;
      uint64_t DIV:2;
      uint64_t reservedSpace2:10;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR;

