iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
};

#define RTC_0 (*(volatile struct RTC_0_tag *) 0xfffffeb0)

struct SCKC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCEN:1;
      uint64_t OSC32EN:1;
      uint64_t OSC32BYP:1;
      uint64_t OSCSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

};

#define SCKC_0 (*(volatile struct SCKC_0_tag *) 0xfffffe50)

struct SFR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES0:1;
      uint64_t RES1:1;
      uint64_t RES2:1;
      uint64_t reservedSpace0:1;
      uint64_t ARIE:1;
      uint64_t APPSTART:1;
      uint64_t reservedSpace1:17;
      uint64_t UDPPUDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OHCIICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIS0:1;
      uint64_t RIS1:1;
      uint64_t RIS2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OHCIISR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t PFETCH10:1;
      uint64_t PFETCH11:1;
      uint64_t PFETCH12:1;
      uint64_t PFETCH13:1;
      uint64_t PFETCH14:1;
      uint64_t reservedSpace1:11;
      uint64_t DLBOPT10:1;
      uint64_t DLBOPT11:1;
      uint64_t DLBOPT12:1;
      uint64_t DLBOPT13:1;
      uint64_t DLBOPT14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APBTURBO:1;
      uint64_t reservedSpace0:7;
      uint64_t AXI2AHBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRIDGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROM:1;
      uint64_t reservedSpace0:7;
      uint64_t FUSE_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECURE;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:2;
      uint64_t reservedSpace0:14;
      uint64_t VBG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTMICKTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQUELCH:3;
      uint64_t reservedSpace0:1;
      uint64_t DISC:3;
      uint64_t reservedSpace1:1;
      uint64_t SLOPE0:3;
      uint64_t reservedSpace2:1;
      uint64_t SLOPE1:3;
      uint64_t reservedSpace3:1;
      uint64_t SLOPE2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTMIHSTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RISE:3;
      uint64_t reservedSpace0:1;
      uint64_t FALL:3;
      uint64_t reservedSpace1:1;
      uint64_t XCVR:2;
      uint64_t reservedSpace2:6;
      uint64_t ZN:3;
      uint64_t reservedSpace3:1;
      uint64_t ZP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTMIFSTRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT0:1;
      uint64_t PORT1:1;
      uint64_t PORT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UTMISWAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRIVE0:2;
      uint64_t PULL0:2;
      uint64_t SCH0:1;
      uint64_t reservedSpace0:3;
      uint64_t DRIVE1:2;
      uint64_t PULL1:2;
      uint64_t SCH1:1;
      uint64_t reservedSpace1:3;
      uint64_t BMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBICFG;

};

#define SFR_0 (*(volatile struct SFR_0_tag *) 0xf0038010)

struct SHA_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t reservedSpace0:3;
      uint64_t FIRST:1;
      uint64_t reservedSpace1:3;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:2;
      uint64_t reservedSpace0:2;
      uint64_t PROCDLY:1;
      uint64_t reservedSpace1:3;
      uint64_t ALGO:3;
      uint64_t reservedSpace2:5;
      uint64_t DUALBUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
      uint64_t reservedSpace1:3;
      uint64_t URAT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATAR;

  uint8_t res2[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IODATAR;

};

#define SHA_0 (*(volatile struct SHA_0_tag *) 0xf8034000)

struct SHDWC_0_tag
{
  uint32_t CR;
  uint32_t MR;
  uint32_t SR;
};

#define SHDWC_0 (*(volatile struct SHDWC_0_tag *) 0xfffffe10)

struct SMC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAGESIZE:3;
      uint64_t reservedSpace0:5;
      uint64_t WSPARE:1;
      uint64_t RSPARE:1;
      uint64_t reservedSpace1:2;
      uint64_t EDGECTRL:1;
      uint64_t RBEDGE:1;
      uint64_t reservedSpace2:2;
      uint64_t DTOCYC:4;
      uint64_t DTOMUL:3;
      uint64_t reservedSpace3:1;
      uint64_t NFCSPARESIZE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFCEN:1;
      uint64_t NFCDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMCSTS:1;
      uint64_t reservedSpace0:3;
      uint64_t RB_RISE:1;
      uint64_t RB_FALL:1;
      uint64_t reservedSpace1:2;
      uint64_t NFCBUSY:1;
      uint64_t reservedSpace2:2;
      uint64_t NFCWR:1;
      uint64_t NFCSID:3;
      uint64_t reservedSpace3:1;
      uint64_t XFRDONE:1;
      uint64_t CMDDONE:1;
      uint64_t ECCRDY:1;
      uint64_t reservedSpace4:1;
      uint64_t DTOE:1;
      uint64_t UNDEF:1;
      uint64_t AWB:1;
      uint64_t NFCASE:1;
      uint64_t RB_EDGE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RB_RISE:1;
      uint64_t RB_FALL:1;
      uint64_t reservedSpace1:10;
      uint64_t XFRDONE:1;
      uint64_t CMDDONE:1;
      uint64_t reservedSpace2:2;
      uint64_t DTOE:1;
      uint64_t UNDEF:1;
      uint64_t AWB:1;
      uint64_t NFCASE:1;
      uint64_t RB_EDGE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RB_RISE:1;
      uint64_t RB_FALL:1;
      uint64_t reservedSpace1:10;
      uint64_t XFRDONE:1;
      uint64_t CMDDONE:1;
      uint64_t reservedSpace2:2;
      uint64_t DTOE:1;
      uint64_t UNDEF:1;
      uint64_t AWB:1;
      uint64_t NFCASE:1;
      uint64_t RB_EDGE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t RB_RISE:1;
      uint64_t RB_FALL:1;
      uint64_t reservedSpace1:10;
      uint64_t XFRDONE:1;
      uint64_t CMDDONE:1;
      uint64_t reservedSpace2:2;
      uint64_t DTOE:1;
      uint64_t UNDEF:1;
      uint64_t AWB:1;
      uint64_t NFCASE:1;
      uint64_t RB_EDGE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_CYCLE0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BANK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BANK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_PAGESIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t TYPCORREC:2;
      uint64_t reservedSpace1:2;
      uint64_t HAMMING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_MD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RECERR0:1;
      uint64_t ECCERR0:1;
      uint64_t MULERR0:1;
      uint64_t reservedSpace0:1;
      uint64_t RECERR1:1;
      uint64_t ECCERR1:1;
      uint64_t MULERR1:1;
      uint64_t reservedSpace1:1;
      uint64_t RECERR2:1;
      uint64_t ECCERR2:1;
      uint64_t MULERR2:1;
      uint64_t reservedSpace2:1;
      uint64_t RECERR3:1;
      uint64_t ECCERR3:1;
      uint64_t MULERR3:1;
      uint64_t reservedSpace3:1;
      uint64_t RECERR4:1;
      uint64_t ECCERR4:1;
      uint64_t MULERR4:1;
      uint64_t reservedSpace4:1;
      uint64_t RECERR5:1;
      uint64_t ECCERR5:1;
      uint64_t MULERR5:1;
      uint64_t reservedSpace5:1;
      uint64_t RECERR6:1;
      uint64_t ECCERR6:1;
      uint64_t MULERR6:1;
      uint64_t reservedSpace6:1;
      uint64_t RECERR7:1;
      uint64_t ECCERR7:1;
      uint64_t MULERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:4;
      uint64_t BITADDR_W9BIT:3;
      uint64_t BITADDR_W8BIT:3;
      uint64_t WORDADDR_W9BIT:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t WORDADDR:12;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPARITY:16;
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY_W9BIT:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RECERR8:1;
      uint64_t ECCERR8:1;
      uint64_t MULERR8:1;
      uint64_t reservedSpace0:1;
      uint64_t RECERR9:1;
      uint64_t ECCERR9:1;
      uint64_t MULERR9:1;
      uint64_t reservedSpace1:1;
      uint64_t RECERR10:1;
      uint64_t ECCERR10:1;
      uint64_t MULERR10:1;
      uint64_t reservedSpace2:1;
      uint64_t RECERR11:1;
      uint64_t ECCERR11:1;
      uint64_t MULERR11:1;
      uint64_t reservedSpace3:1;
      uint64_t RECERR12:1;
      uint64_t ECCERR12:1;
      uint64_t MULERR12:1;
      uint64_t reservedSpace4:1;
      uint64_t RECERR13:1;
      uint64_t ECCERR13:1;
      uint64_t MULERR13:1;
      uint64_t reservedSpace5:1;
      uint64_t RECERR14:1;
      uint64_t ECCERR14:1;
      uint64_t MULERR14:1;
      uint64_t reservedSpace6:1;
      uint64_t RECERR15:1;
      uint64_t ECCERR15:1;
      uint64_t MULERR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:9;
      uint64_t WORDADDR_W8BIT:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:12;
      uint64_t NPARITY_W8BIT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BITADDR:3;
      uint64_t WORDADDR:8;
      uint64_t reservedSpace0:1;
      uint64_t NPARITY:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_PR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCH_ERR:3;
      uint64_t reservedSpace0:1;
      uint64_t SECTORSZ:1;
      uint64_t reservedSpace1:3;
      uint64_t PAGESIZE:2;
      uint64_t reservedSpace2:2;
      uint64_t NANDWR:1;
      uint64_t reservedSpace3:3;
      uint64_t SPAREEN:1;
      uint64_t reservedSpace4:3;
      uint64_t AUTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPARESIZE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCSAREA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCSADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCEADDR;

