iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t DATA:1;
      uint64_t USER:1;
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t reservedSpace0:3;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMECCISR;

  uint8_t res1[20];

  uint32_t PMECC0_0;
  uint32_t PMECC1_0;
  uint32_t PMECC2_0;
  uint32_t PMECC3_0;
  uint32_t PMECC4_0;
  uint32_t PMECC5_0;
  uint32_t PMECC6_0;
  uint32_t PMECC7_0;
  uint32_t PMECC8_0;
  uint32_t PMECC9_0;
  uint32_t PMECC10_0;
  uint8_t res2[20];

  uint32_t PMECC0_1;
  uint32_t PMECC1_1;
  uint32_t PMECC2_1;
  uint32_t PMECC3_1;
  uint32_t PMECC4_1;
  uint32_t PMECC5_1;
  uint32_t PMECC6_1;
  uint32_t PMECC7_1;
  uint32_t PMECC8_1;
  uint32_t PMECC9_1;
  uint32_t PMECC10_1;
  uint8_t res3[20];

  uint32_t PMECC0_2;
  uint32_t PMECC1_2;
  uint32_t PMECC2_2;
  uint32_t PMECC3_2;
  uint32_t PMECC4_2;
  uint32_t PMECC5_2;
  uint32_t PMECC6_2;
  uint32_t PMECC7_2;
  uint32_t PMECC8_2;
  uint32_t PMECC9_2;
  uint32_t PMECC10_2;
  uint8_t res4[20];

  uint32_t PMECC0_3;
  uint32_t PMECC1_3;
  uint32_t PMECC2_3;
  uint32_t PMECC3_3;
  uint32_t PMECC4_3;
  uint32_t PMECC5_3;
  uint32_t PMECC6_3;
  uint32_t PMECC7_3;
  uint32_t PMECC8_3;
  uint32_t PMECC9_3;
  uint32_t PMECC10_3;
  uint8_t res5[20];

  uint32_t PMECC0_4;
  uint32_t PMECC1_4;
  uint32_t PMECC2_4;
  uint32_t PMECC3_4;
  uint32_t PMECC4_4;
  uint32_t PMECC5_4;
  uint32_t PMECC6_4;
  uint32_t PMECC7_4;
  uint32_t PMECC8_4;
  uint32_t PMECC9_4;
  uint32_t PMECC10_4;
  uint8_t res6[20];

  uint32_t PMECC0_5;
  uint32_t PMECC1_5;
  uint32_t PMECC2_5;
  uint32_t PMECC3_5;
  uint32_t PMECC4_5;
  uint32_t PMECC5_5;
  uint32_t PMECC6_5;
  uint32_t PMECC7_5;
  uint32_t PMECC8_5;
  uint32_t PMECC9_5;
  uint32_t PMECC10_5;
  uint8_t res7[20];

  uint32_t PMECC0_6;
  uint32_t PMECC1_6;
  uint32_t PMECC2_6;
  uint32_t PMECC3_6;
  uint32_t PMECC4_6;
  uint32_t PMECC5_6;
  uint32_t PMECC6_6;
  uint32_t PMECC7_6;
  uint32_t PMECC8_6;
  uint32_t PMECC9_6;
  uint32_t PMECC10_6;
  uint8_t res8[20];

  uint32_t PMECC0_7;
  uint32_t PMECC1_7;
  uint32_t PMECC2_7;
  uint32_t PMECC3_7;
  uint32_t PMECC4_7;
  uint32_t PMECC5_7;
  uint32_t PMECC6_7;
  uint32_t PMECC7_7;
  uint32_t PMECC8_7;
  uint32_t PMECC9_7;
  uint32_t PMECC10_7;
  uint8_t res9[20];

  uint32_t REM0_0;
  uint32_t REM1_0;
  uint32_t REM2_0;
  uint32_t REM3_0;
  uint32_t REM4_0;
  uint32_t REM5_0;
  uint32_t REM6_0;
  uint32_t REM7_0;
  uint32_t REM8_0;
  uint32_t REM9_0;
  uint32_t REM10_0;
  uint32_t REM11_0;
  uint8_t res10[16];

  uint32_t REM0_1;
  uint32_t REM1_1;
  uint32_t REM2_1;
  uint32_t REM3_1;
  uint32_t REM4_1;
  uint32_t REM5_1;
  uint32_t REM6_1;
  uint32_t REM7_1;
  uint32_t REM8_1;
  uint32_t REM9_1;
  uint32_t REM10_1;
  uint32_t REM11_1;
  uint8_t res11[16];

  uint32_t REM0_2;
  uint32_t REM1_2;
  uint32_t REM2_2;
  uint32_t REM3_2;
  uint32_t REM4_2;
  uint32_t REM5_2;
  uint32_t REM6_2;
  uint32_t REM7_2;
  uint32_t REM8_2;
  uint32_t REM9_2;
  uint32_t REM10_2;
  uint32_t REM11_2;
  uint8_t res12[16];

  uint32_t REM0_3;
  uint32_t REM1_3;
  uint32_t REM2_3;
  uint32_t REM3_3;
  uint32_t REM4_3;
  uint32_t REM5_3;
  uint32_t REM6_3;
  uint32_t REM7_3;
  uint32_t REM8_3;
  uint32_t REM9_3;
  uint32_t REM10_3;
  uint32_t REM11_3;
  uint8_t res13[16];

  uint32_t REM0_4;
  uint32_t REM1_4;
  uint32_t REM2_4;
  uint32_t REM3_4;
  uint32_t REM4_4;
  uint32_t REM5_4;
  uint32_t REM6_4;
  uint32_t REM7_4;
  uint32_t REM8_4;
  uint32_t REM9_4;
  uint32_t REM10_4;
  uint32_t REM11_4;
  uint8_t res14[16];

  uint32_t REM0_5;
  uint32_t REM1_5;
  uint32_t REM2_5;
  uint32_t REM3_5;
  uint32_t REM4_5;
  uint32_t REM5_5;
  uint32_t REM6_5;
  uint32_t REM7_5;
  uint32_t REM8_5;
  uint32_t REM9_5;
  uint32_t REM10_5;
  uint32_t REM11_5;
  uint8_t res15[16];

  uint32_t REM0_6;
  uint32_t REM1_6;
  uint32_t REM2_6;
  uint32_t REM3_6;
  uint32_t REM4_6;
  uint32_t REM5_6;
  uint32_t REM6_6;
  uint32_t REM7_6;
  uint32_t REM8_6;
  uint32_t REM9_6;
  uint32_t REM10_6;
  uint32_t REM11_6;
  uint8_t res16[16];

  uint32_t REM0_7;
  uint32_t REM1_7;
  uint32_t REM2_7;
  uint32_t REM3_7;
  uint32_t REM4_7;
  uint32_t REM5_7;
  uint32_t REM6_7;
  uint32_t REM7_7;
  uint32_t REM8_7;
  uint32_t REM9_7;
  uint32_t REM10_7;
  uint32_t REM11_7;
  uint8_t res17[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECTORSZ:1;
      uint64_t reservedSpace0:15;
      uint64_t ERRNUM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRIMITIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELPRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENINIT:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t reservedSpace0:7;
      uint64_t ERR_CNT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELISR;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA0:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA1:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA2:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA3:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA4:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA5:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA6:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA7:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA8:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA9:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA10:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA11:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA12:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA13:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA14:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA15:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA16:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA17:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA18:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA19:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA20:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA21:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA22:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA23:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGMA24:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIGMA24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOCN:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRLOC;

  uint8_t res19[112];

  uint32_t SETUP0;
  uint32_t PULSE0;
  uint32_t CYCLE0;
  uint32_t TIMINGS0;
  uint32_t MODE0;
  uint32_t SETUP1;
  uint32_t PULSE1;
  uint32_t CYCLE1;
  uint32_t TIMINGS1;
  uint32_t MODE1;
  uint32_t SETUP2;
  uint32_t PULSE2;
  uint32_t CYCLE2;
  uint32_t TIMINGS2;
  uint32_t MODE2;
  uint32_t SETUP3;
  uint32_t PULSE3;
  uint32_t CYCLE3;
  uint32_t TIMINGS3;
  uint32_t MODE3;
  uint8_t res20[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMSE:1;
      uint64_t SRSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY2;

