iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
struct UART_UART1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSTRX:1;
      uint64_t RSTTX:1;
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RSTSTA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t PAR:3;
      uint64_t reservedSpace1:2;
      uint64_t CHMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:3;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRGR;

};

#define UART_UART1_0 (*(volatile struct UART_UART1_0_tag *) 0xf8028000)

struct UDPHS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ADDR:7;
      uint64_t FADDR_EN:1;
      uint64_t EN_UDPHS:1;
      uint64_t DETACH:1;
      uint64_t REWAKEUP:1;
      uint64_t PULLD_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MICRO_FRAME_NUM:3;
      uint64_t FRAME_NUMBER:11;
      uint64_t reservedSpace0:17;
      uint64_t FNUM_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNUM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DET_SUSPD:1;
      uint64_t MICRO_SOF:1;
      uint64_t INT_SOF:1;
      uint64_t ENDRESET:1;
      uint64_t WAKE_UP:1;
      uint64_t ENDOFRSM:1;
      uint64_t UPSTR_RES:1;
      uint64_t EPT_0:1;
      uint64_t EPT_1:1;
      uint64_t EPT_2:1;
      uint64_t EPT_3:1;
      uint64_t EPT_4:1;
      uint64_t EPT_5:1;
      uint64_t EPT_6:1;
      uint64_t EPT_7:1;
      uint64_t EPT_8:1;
      uint64_t EPT_9:1;
      uint64_t EPT_10:1;
      uint64_t EPT_11:1;
      uint64_t EPT_12:1;
      uint64_t EPT_13:1;
      uint64_t EPT_14:1;
      uint64_t EPT_15:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA_1:1;
      uint64_t DMA_2:1;
      uint64_t DMA_3:1;
      uint64_t DMA_4:1;
      uint64_t DMA_5:1;
      uint64_t DMA_6:1;
      uint64_t DMA_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPEED:1;
      uint64_t DET_SUSPD:1;
      uint64_t MICRO_SOF:1;
      uint64_t INT_SOF:1;
      uint64_t ENDRESET:1;
      uint64_t WAKE_UP:1;
      uint64_t ENDOFRSM:1;
      uint64_t UPSTR_RES:1;
      uint64_t EPT_0:1;
      uint64_t EPT_1:1;
      uint64_t EPT_2:1;
      uint64_t EPT_3:1;
      uint64_t EPT_4:1;
      uint64_t EPT_5:1;
      uint64_t EPT_6:1;
      uint64_t EPT_7:1;
      uint64_t EPT_8:1;
      uint64_t EPT_9:1;
      uint64_t EPT_10:1;
      uint64_t EPT_11:1;
      uint64_t EPT_12:1;
      uint64_t EPT_13:1;
      uint64_t EPT_14:1;
      uint64_t EPT_15:1;
      uint64_t reservedSpace0:1;
      uint64_t DMA_1:1;
      uint64_t DMA_2:1;
      uint64_t DMA_3:1;
      uint64_t DMA_4:1;
      uint64_t DMA_5:1;
      uint64_t DMA_6:1;
      uint64_t DMA_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DET_SUSPD:1;
      uint64_t MICRO_SOF:1;
      uint64_t INT_SOF:1;
      uint64_t ENDRESET:1;
      uint64_t WAKE_UP:1;
      uint64_t ENDOFRSM:1;
      uint64_t UPSTR_RES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLRINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPT_0:1;
      uint64_t EPT_1:1;
      uint64_t EPT_2:1;
      uint64_t EPT_3:1;
      uint64_t EPT_4:1;
      uint64_t EPT_5:1;
      uint64_t EPT_6:1;
      uint64_t EPT_7:1;
      uint64_t EPT_8:1;
      uint64_t EPT_9:1;
      uint64_t EPT_10:1;
      uint64_t EPT_11:1;
      uint64_t EPT_12:1;
      uint64_t EPT_13:1;
      uint64_t EPT_14:1;
      uint64_t EPT_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPTRST;

  uint8_t res1[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPEED_CFG:2;
      uint64_t TST_J:1;
      uint64_t TST_K:1;
      uint64_t TST_PKT:1;
      uint64_t OPMODE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TST;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IP_NAME1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPNAME1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IP_NAME2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPNAME2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPT_NBR_MAX:4;
      uint64_t DMA_CHANNEL_NBR:3;
      uint64_t DMA_B_SIZ:1;
      uint64_t DMA_FIFO_WORD_DEPTH:4;
      uint64_t FIFO_MAX_SIZE:3;
      uint64_t BW_DPRAM:1;
      uint64_t DATAB16_8:1;
      uint64_t ISO_EPT_1:1;
      uint64_t ISO_EPT_2:1;
      uint64_t ISO_EPT_3:1;
      uint64_t ISO_EPT_4:1;
      uint64_t ISO_EPT_5:1;
      uint64_t ISO_EPT_6:1;
      uint64_t ISO_EPT_7:1;
      uint64_t ISO_EPT_8:1;
      uint64_t ISO_EPT_9:1;
      uint64_t ISO_EPT_10:1;
      uint64_t ISO_EPT_11:1;
      uint64_t ISO_EPT_12:1;
      uint64_t ISO_EPT_13:1;
      uint64_t ISO_EPT_14:1;
      uint64_t ISO_EPT_15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPFEATURES;

