iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
};

#define WDT_0 (*(volatile struct WDT_0_tag *) 0xfffffe40)

struct ADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t START:1;
      uint64_t TSCALIB:1;
      uint64_t AUTOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TRGSEL:3;
      uint64_t LOWRES:1;
      uint64_t SLEEP:1;
      uint64_t FWUP:1;
      uint64_t reservedSpace1:1;
      uint64_t PRESCAL:8;
      uint64_t STARTUP:4;
      uint64_t SETTLING:2;
      uint64_t reservedSpace2:1;
      uint64_t ANACH:1;
      uint64_t TRACKTIM:4;
      uint64_t reservedSpace3:3;
      uint64_t USEQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USCH1:4;
      uint64_t USCH2:4;
      uint64_t USCH3:4;
      uint64_t USCH4:4;
      uint64_t USCH5:4;
      uint64_t USCH6:4;
      uint64_t USCH7:4;
      uint64_t USCH8:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USCH9:4;
      uint64_t USCH10:4;
      uint64_t USCH11:4;
      uint64_t USCH12:4;
      uint64_t USCH13:4;
      uint64_t USCH14:4;
      uint64_t USCH15:4;
      uint64_t USCH16:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDATA:12;
      uint64_t CHNB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t reservedSpace0:8;
      uint64_t XRDY:1;
      uint64_t YRDY:1;
      uint64_t PRDY:1;
      uint64_t EOCAL:1;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t reservedSpace1:2;
      uint64_t PEN:1;
      uint64_t NOPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t reservedSpace0:8;
      uint64_t XRDY:1;
      uint64_t YRDY:1;
      uint64_t PRDY:1;
      uint64_t EOCAL:1;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t reservedSpace1:2;
      uint64_t PEN:1;
      uint64_t NOPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t reservedSpace0:8;
      uint64_t XRDY:1;
      uint64_t YRDY:1;
      uint64_t PRDY:1;
      uint64_t EOCAL:1;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t reservedSpace1:2;
      uint64_t PEN:1;
      uint64_t NOPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t reservedSpace0:8;
      uint64_t XRDY:1;
      uint64_t YRDY:1;
      uint64_t PRDY:1;
      uint64_t EOCAL:1;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t reservedSpace1:2;
      uint64_t PEN:1;
      uint64_t NOPEN:1;
      uint64_t PENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRE0:1;
      uint64_t OVRE1:1;
      uint64_t OVRE2:1;
      uint64_t OVRE3:1;
      uint64_t OVRE4:1;
      uint64_t OVRE5:1;
      uint64_t OVRE6:1;
      uint64_t OVRE7:1;
      uint64_t OVRE8:1;
      uint64_t OVRE9:1;
      uint64_t OVRE10:1;
      uint64_t OVRE11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMODE:2;
      uint64_t reservedSpace0:2;
      uint64_t CMPSEL:4;
      uint64_t reservedSpace1:1;
      uint64_t CMPALL:1;
      uint64_t reservedSpace2:2;
      uint64_t CMPFILTER:2;
      uint64_t reservedSpace3:10;
      uint64_t TAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWTHRES:12;
      uint64_t reservedSpace0:4;
      uint64_t HIGHTHRES:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN0:2;
      uint64_t GAIN1:2;
      uint64_t GAIN2:2;
      uint64_t GAIN3:2;
      uint64_t GAIN4:2;
      uint64_t GAIN5:2;
      uint64_t GAIN6:2;
      uint64_t GAIN7:2;
      uint64_t GAIN8:2;
      uint64_t GAIN9:2;
      uint64_t GAIN10:2;
      uint64_t GAIN11:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFF0:1;
      uint64_t OFF1:1;
      uint64_t OFF2:1;
      uint64_t OFF3:1;
      uint64_t OFF4:1;
      uint64_t OFF5:1;
      uint64_t OFF6:1;
      uint64_t OFF7:1;
      uint64_t OFF8:1;
      uint64_t OFF9:1;
      uint64_t OFF10:1;
      uint64_t OFF11:1;
      uint64_t reservedSpace0:4;
      uint64_t DIFF0:1;
      uint64_t DIFF1:1;
      uint64_t DIFF2:1;
      uint64_t DIFF3:1;
      uint64_t DIFF4:1;
      uint64_t DIFF5:1;
      uint64_t DIFF6:1;
      uint64_t DIFF7:1;
      uint64_t DIFF8:1;
      uint64_t DIFF9:1;
      uint64_t DIFF10:1;
      uint64_t DIFF11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDR;

  uint8_t res2[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PENDETSENS:2;
      uint64_t reservedSpace0:6;
      uint64_t IBCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSMODE:2;
      uint64_t reservedSpace0:2;
      uint64_t TSAV:2;
      uint64_t reservedSpace1:2;
      uint64_t TSFREQ:4;
      uint64_t reservedSpace2:4;
      uint64_t TSSCTIM:4;
      uint64_t reservedSpace3:2;
      uint64_t NOTSDMA:1;
      uint64_t reservedSpace4:1;
      uint64_t PENDET:1;
      uint64_t reservedSpace5:3;
      uint64_t PENDBC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPOS:12;
      uint64_t reservedSpace0:4;
      uint64_t XSCALE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XPOSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YPOS:12;
      uint64_t reservedSpace0:4;
      uint64_t YSCALE:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) YPOSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Z1:12;
      uint64_t reservedSpace0:4;
      uint64_t Z2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGMOD:3;
      uint64_t reservedSpace0:13;
      uint64_t TRGPER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGR;

  uint8_t res4[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

