iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
};

#define ADC_1 (*(volatile struct ADC_1_tag *) 0xf8018000)

struct AES_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t reservedSpace0:7;
      uint64_t SWRST:1;
      uint64_t reservedSpace1:7;
      uint64_t LOADSEED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIPHER:1;
      uint64_t reservedSpace0:3;
      uint64_t PROCDLY:4;
      uint64_t SMOD:2;
      uint64_t KEYSIZE:2;
      uint64_t OPMOD:3;
      uint64_t LOD:1;
      uint64_t CFBS:3;
      uint64_t reservedSpace1:1;
      uint64_t CKEY:4;
      uint64_t CMTYP1:1;
      uint64_t CMTYP2:1;
      uint64_t CMTYP3:1;
      uint64_t CMTYP4:1;
      uint64_t CMTYP5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
      uint64_t reservedSpace1:3;
      uint64_t URAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYWR;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDATAR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ODATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ODATAR;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR;

};

#define AES_1 (*(volatile struct AES_1_tag *) 0xf8038000)

struct AIC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRIOR:3;
      uint64_t reservedSpace0:2;
      uint64_t SRCTYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTOR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SVR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIQV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQID:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIQ:1;
      uint64_t SYS:1;
      uint64_t PID2:1;
      uint64_t PID3:1;
      uint64_t PID4:1;
      uint64_t PID5:1;
      uint64_t PID6:1;
      uint64_t PID7:1;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID32:1;
      uint64_t PID33:1;
      uint64_t PID34:1;
      uint64_t PID35:1;
      uint64_t PID36:1;
      uint64_t PID37:1;
      uint64_t PID38:1;
      uint64_t PID39:1;
      uint64_t PID40:1;
      uint64_t PID41:1;
      uint64_t PID42:1;
      uint64_t PID43:1;
      uint64_t PID44:1;
      uint64_t PID45:1;
      uint64_t PID46:1;
      uint64_t PID47:1;
      uint64_t PID48:1;
      uint64_t PID49:1;
      uint64_t PID50:1;
      uint64_t PID51:1;
      uint64_t PID52:1;
      uint64_t PID53:1;
      uint64_t PID54:1;
      uint64_t PID55:1;
      uint64_t PID56:1;
      uint64_t PID57:1;
      uint64_t PID58:1;
      uint64_t PID59:1;
      uint64_t PID60:1;
      uint64_t PID61:1;
      uint64_t PID62:1;
      uint64_t PID63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID64:1;
      uint64_t PID65:1;
      uint64_t PID66:1;
      uint64_t PID67:1;
      uint64_t PID68:1;
      uint64_t PID69:1;
      uint64_t PID70:1;
      uint64_t PID71:1;
      uint64_t PID72:1;
      uint64_t PID73:1;
      uint64_t PID74:1;
      uint64_t PID75:1;
      uint64_t PID76:1;
      uint64_t PID77:1;
      uint64_t PID78:1;
      uint64_t PID79:1;
      uint64_t PID80:1;
      uint64_t PID81:1;
      uint64_t PID82:1;
      uint64_t PID83:1;
      uint64_t PID84:1;
      uint64_t PID85:1;
      uint64_t PID86:1;
      uint64_t PID87:1;
      uint64_t PID88:1;
      uint64_t PID89:1;
      uint64_t PID90:1;
      uint64_t PID91:1;
      uint64_t PID92:1;
      uint64_t PID93:1;
      uint64_t PID94:1;
      uint64_t PID95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID96:1;
      uint64_t PID97:1;
      uint64_t PID98:1;
      uint64_t PID99:1;
      uint64_t PID100:1;
      uint64_t PID101:1;
      uint64_t PID102:1;
      uint64_t PID103:1;
      uint64_t PID104:1;
      uint64_t PID105:1;
      uint64_t PID106:1;
      uint64_t PID107:1;
      uint64_t PID108:1;
      uint64_t PID109:1;
      uint64_t PID110:1;
      uint64_t PID111:1;
      uint64_t PID112:1;
      uint64_t PID113:1;
      uint64_t PID114:1;
      uint64_t PID115:1;
      uint64_t PID116:1;
      uint64_t PID117:1;
      uint64_t PID118:1;
      uint64_t PID119:1;
      uint64_t PID120:1;
      uint64_t PID121:1;
      uint64_t PID122:1;
      uint64_t PID123:1;
      uint64_t PID124:1;
      uint64_t PID125:1;
      uint64_t PID126:1;
      uint64_t PID127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFIQ:1;
      uint64_t NIRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CISR;

  uint32_t EOICR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIVR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FFS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FFSR;

