iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROT:1;
      uint64_t GMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR;

  uint8_t res3[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

};

#define AIC_1 (*(volatile struct AIC_1_tag *) 0xfffff000)

struct AXIMX_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REMAP0:1;
      uint64_t REMAP1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REMAP;

  uint8_t res0[8140];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIPH_ID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP_ID;

  uint8_t res1[12308];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_ISS:1;
      uint64_t WR_ISS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMIB3_FN_MOD_BM_ISS;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BP_MRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMIB3_FN_MOD2;

  uint8_t res3[250072];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB0_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB0_WRITE_QOS;

  uint8_t res4[3872];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_INCR_OVR:1;
      uint64_t WR_INCR_OVR:1;
      uint64_t LOCK_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB1_FN_MOD_AHB;

  uint8_t res5[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB1_READ_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WR_QOS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB1_WRITE_QOS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHB_RD_INCR_OVR:1;
      uint64_t RD_ISS:1;
      uint64_t AHB_WR_INCR_OVR:1;
      uint64_t WR_ISS:1;
      uint64_t AHB_LOCK_OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASIB1_FN_MOD;

};

#define AXIMX_1 (*(volatile struct AXIMX_1_tag *) 0x800000)

struct BSC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOT:8;
      uint64_t reservedSpace0:8;
      uint64_t BOOTKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

};

#define BSC_1 (*(volatile struct BSC_1_tag *) 0xfffffe54)

struct CAN_CAN0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CANEN:1;
      uint64_t LPM:1;
      uint64_t ABM:1;
      uint64_t OVL:1;
      uint64_t TEOF:1;
      uint64_t TTM:1;
      uint64_t TIMFRZ:1;
      uint64_t DRPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:8;
      uint64_t ERRA:1;
      uint64_t WARN:1;
      uint64_t ERRP:1;
      uint64_t BOFF:1;
      uint64_t SLEEP:1;
      uint64_t WAKEUP:1;
      uint64_t TOVF:1;
      uint64_t TSTP:1;
      uint64_t CERR:1;
      uint64_t SERR:1;
      uint64_t AERR:1;
      uint64_t FERR:1;
      uint64_t BERR:1;
      uint64_t RBSY:1;
      uint64_t TBSY:1;
      uint64_t OVLSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHASE2:3;
      uint64_t reservedSpace0:1;
      uint64_t PHASE1:3;
      uint64_t reservedSpace1:1;
      uint64_t PROPAG:3;
      uint64_t reservedSpace2:1;
      uint64_t SJW:2;
      uint64_t reservedSpace3:2;
      uint64_t BRP:7;
      uint64_t reservedSpace4:1;
      uint64_t SMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTIMESTAMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMESTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t reservedSpace0:8;
      uint64_t TEC:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
      uint64_t reservedSpace0:23;
      uint64_t TIMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB0:1;
      uint64_t MB1:1;
      uint64_t MB2:1;
      uint64_t MB3:1;
      uint64_t MB4:1;
      uint64_t MB5:1;
      uint64_t MB6:1;
      uint64_t MB7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  uint8_t res0[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

  uint8_t res1[276];

