iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t BTC4:1;
      uint64_t BTC5:1;
      uint64_t BTC6:1;
      uint64_t BTC7:1;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t CBTC4:1;
      uint64_t CBTC5:1;
      uint64_t CBTC6:1;
      uint64_t CBTC7:1;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
      uint64_t ERR4:1;
      uint64_t ERR5:1;
      uint64_t ERR6:1;
      uint64_t ERR7:1;
      uint64_t DICERR0:1;
      uint64_t DICERR1:1;
      uint64_t DICERR2:1;
      uint64_t DICERR3:1;
      uint64_t DICERR4:1;
      uint64_t DICERR5:1;
      uint64_t DICERR6:1;
      uint64_t DICERR7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBCISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t ENA6:1;
      uint64_t ENA7:1;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t SUSP6:1;
      uint64_t SUSP7:1;
      uint64_t reservedSpace0:8;
      uint64_t KEEP0:1;
      uint64_t KEEP1:1;
      uint64_t KEEP2:1;
      uint64_t KEEP3:1;
      uint64_t KEEP4:1;
      uint64_t KEEP5:1;
      uint64_t KEEP6:1;
      uint64_t KEEP7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS0:1;
      uint64_t DIS1:1;
      uint64_t DIS2:1;
      uint64_t DIS3:1;
      uint64_t DIS4:1;
      uint64_t DIS5:1;
      uint64_t DIS6:1;
      uint64_t DIS7:1;
      uint64_t RES0:1;
      uint64_t RES1:1;
      uint64_t RES2:1;
      uint64_t RES3:1;
      uint64_t RES4:1;
      uint64_t RES5:1;
      uint64_t RES6:1;
      uint64_t RES7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t ENA4:1;
      uint64_t ENA5:1;
      uint64_t ENA6:1;
      uint64_t ENA7:1;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t SUSP4:1;
      uint64_t SUSP5:1;
      uint64_t SUSP6:1;
      uint64_t SUSP7:1;
      uint64_t EMPT0:1;
      uint64_t EMPT1:1;
      uint64_t EMPT2:1;
      uint64_t EMPT3:1;
      uint64_t EMPT4:1;
      uint64_t EMPT5:1;
      uint64_t EMPT6:1;
      uint64_t EMPT7:1;
      uint64_t STAL0:1;
      uint64_t STAL1:1;
      uint64_t STAL2:1;
      uint64_t STAL3:1;
      uint64_t STAL4:1;
      uint64_t STAL5:1;
      uint64_t STAL6:1;
      uint64_t STAL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSR;

  uint8_t res1[8];

  uint32_t SADDR0;
  uint32_t DADDR0;
  uint32_t DSCR0;
  uint32_t CTRLA0;
  uint32_t CTRLB0;
  uint32_t CFG0;
  uint32_t SPIP0;
  uint32_t DPIP0;
  uint8_t res2[8];

  uint32_t SADDR1;
  uint32_t DADDR1;
  uint32_t DSCR1;
  uint32_t CTRLA1;
  uint32_t CTRLB1;
  uint32_t CFG1;
  uint32_t SPIP1;
  uint32_t DPIP1;
  uint8_t res3[8];

  uint32_t SADDR2;
  uint32_t DADDR2;
  uint32_t DSCR2;
  uint32_t CTRLA2;
  uint32_t CTRLB2;
  uint32_t CFG2;
  uint32_t SPIP2;
  uint32_t DPIP2;
  uint8_t res4[8];

