iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res1[8];

  uint32_t SADDR0;
  uint32_t DADDR0;
  uint32_t DSCR0;
  uint32_t CTRLA0;
  uint32_t CTRLB0;
  uint32_t CFG0;
  uint32_t SPIP0;
  uint32_t DPIP0;
  uint8_t res2[8];

  uint32_t SADDR1;
  uint32_t DADDR1;
  uint32_t DSCR1;
  uint32_t CTRLA1;
  uint32_t CTRLB1;
  uint32_t CFG1;
  uint32_t SPIP1;
  uint32_t DPIP1;
  uint8_t res3[8];

  uint32_t SADDR2;
  uint32_t DADDR2;
  uint32_t DSCR2;
  uint32_t CTRLA2;
  uint32_t CTRLB2;
  uint32_t CFG2;
  uint32_t SPIP2;
  uint32_t DPIP2;
  uint8_t res4[8];

  uint32_t SADDR3;
  uint32_t DADDR3;
  uint32_t DSCR3;
  uint32_t CTRLA3;
  uint32_t CTRLB3;
  uint32_t CFG3;
  uint32_t SPIP3;
  uint32_t DPIP3;
  uint8_t res5[8];

  uint32_t SADDR4;
  uint32_t DADDR4;
  uint32_t DSCR4;
  uint32_t CTRLA4;
  uint32_t CTRLB4;
  uint32_t CFG4;
  uint32_t SPIP4;
  uint32_t DPIP4;
  uint8_t res6[8];

  uint32_t SADDR5;
  uint32_t DADDR5;
  uint32_t DSCR5;
  uint32_t CTRLA5;
  uint32_t CTRLB5;
  uint32_t CFG5;
  uint32_t SPIP5;
  uint32_t DPIP5;
  uint8_t res7[8];

  uint32_t SADDR6;
  uint32_t DADDR6;
  uint32_t DSCR6;
  uint32_t CTRLA6;
  uint32_t CTRLB6;
  uint32_t CFG6;
  uint32_t SPIP6;
  uint32_t DPIP6;
  uint8_t res8[8];

  uint32_t SADDR7;
  uint32_t DADDR7;
  uint32_t DSCR7;
  uint32_t CTRLA7;
  uint32_t CTRLB7;
  uint32_t CFG7;
  uint32_t SPIP7;
  uint32_t DPIP7;
  uint8_t res9[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

};

#define DMAC_DMAC1_1 (*(volatile struct DMAC_DMAC1_1_tag *) 0xffffe800)

struct EMAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LB:1;
      uint64_t LLB:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t MPE:1;
      uint64_t CLRSTAT:1;
      uint64_t INCSTAT:1;
      uint64_t WESTAT:1;
      uint64_t BP:1;
      uint64_t TSTART:1;
      uint64_t THALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPD:1;
      uint64_t FD:1;
      uint64_t reservedSpace0:1;
      uint64_t JFRAME:1;
      uint64_t CAF:1;
      uint64_t NBC:1;
      uint64_t MTI:1;
      uint64_t UNI:1;
      uint64_t BIG:1;
      uint64_t reservedSpace1:1;
      uint64_t CLK:2;
      uint64_t RTY:1;
      uint64_t PAE:1;
      uint64_t RBOF:2;
      uint64_t RLCE:1;
      uint64_t DRFCS:1;
      uint64_t EFRHD:1;
      uint64_t IRXFCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDIO:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UBR:1;
      uint64_t COL:1;
      uint64_t RLES:1;
      uint64_t TGO:1;
      uint64_t BEX:1;
      uint64_t COMP:1;
      uint64_t UND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBQP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBQP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNA:1;
      uint64_t REC:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLEX:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFRE:1;
      uint64_t PTZ:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t CODE:2;
      uint64_t REGA:5;
      uint64_t PHYA:5;
      uint64_t RW:2;
      uint64_t SOF:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTOK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCOL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXCOL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUND:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TUND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROVR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RJB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RJA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLFM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLE;

