iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRT;

  uint32_t SA1B;
  uint32_t SA1T;
  uint32_t SA2B;
  uint32_t SA2T;
  uint32_t SA3B;
  uint32_t SA3T;
  uint32_t SA4B;
  uint32_t SA4T;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TID;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMII:1;
      uint64_t CLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USRIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IP:16;
      uint64_t MAG:1;
      uint64_t ARP:1;
      uint64_t SA1:1;
      uint64_t MTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOL;

};

#define EMAC_1 (*(volatile struct EMAC_1_tag *) 0xf802c000)

struct FUSE_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRQ:1;
      uint64_t RRQ:1;
      uint64_t reservedSpace0:6;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WS:1;
      uint64_t RS:1;
      uint64_t reservedSpace0:6;
      uint64_t WSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define FUSE_1 (*(volatile struct FUSE_1_tag *) 0xffffe400)

struct GMAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LB:1;
      uint64_t LBL:1;
      uint64_t RXEN:1;
      uint64_t TXEN:1;
      uint64_t MPE:1;
      uint64_t CLRSTAT:1;
      uint64_t INCSTAT:1;
      uint64_t WESTAT:1;
      uint64_t BP:1;
      uint64_t TSTART:1;
      uint64_t THALT:1;
      uint64_t TXPF:1;
      uint64_t TXZQPF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDS:1;
      uint64_t SRTSM:1;
      uint64_t ENPBPR:1;
      uint64_t TXPBPF:1;
      uint64_t FNP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPD:1;
      uint64_t FD:1;
      uint64_t DNVLAN:1;
      uint64_t JFRAME:1;
      uint64_t CAF:1;
      uint64_t NBC:1;
      uint64_t MTIHEN:1;
      uint64_t UNIHEN:1;
      uint64_t MAXFS:1;
      uint64_t reservedSpace0:1;
      uint64_t GBE:1;
      uint64_t PIS:1;
      uint64_t RTY:1;
      uint64_t PEN:1;
      uint64_t RXBUFO:2;
      uint64_t LFERD:1;
      uint64_t RFCS:1;
      uint64_t CLK:3;
      uint64_t DBW:2;
      uint64_t DCPF:1;
      uint64_t RXCOEN:1;
      uint64_t EFRHD:1;
      uint64_t IRXFCS:1;
      uint64_t reservedSpace1:1;
      uint64_t IPGSEN:1;
      uint64_t RXBP:1;
      uint64_t IRXER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDIO:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RGMII:1;
      uint64_t reservedSpace0:5;
      uint64_t HDFC:1;
      uint64_t BPDG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FBLDO:5;
      uint64_t reservedSpace0:1;
      uint64_t ESMA:1;
      uint64_t ESPA:1;
      uint64_t RXBMS:2;
      uint64_t TXPBMS:1;
      uint64_t TXCOEN:1;
      uint64_t reservedSpace1:4;
      uint64_t DRBS:8;
      uint64_t DDRP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UBR:1;
      uint64_t COL:1;
      uint64_t RLE:1;
      uint64_t TXGO:1;
      uint64_t TFC:1;
      uint64_t TXCOMP:1;
      uint64_t UND:1;
      uint64_t LCO:1;
      uint64_t HRESP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBQB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBQB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNA:1;
      uint64_t REC:1;
      uint64_t RXOVR:1;
      uint64_t HNO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
      uint64_t SRI:1;
      uint64_t reservedSpace2:1;
      uint64_t WOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFS:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUR:1;
      uint64_t RLEX:1;
      uint64_t TFC:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFNZ:1;
      uint64_t PTZ:1;
      uint64_t PFTR:1;
      uint64_t EXINT:1;
      uint64_t reservedSpace1:2;
      uint64_t DRQFR:1;
      uint64_t SFR:1;
      uint64_t DRQFT:1;
      uint64_t SFT:1;
      uint64_t PDRQFR:1;
      uint64_t PDRSFR:1;
      uint64_t PDRQFT:1;
      uint64_t PDRSFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t WTN:2;
      uint64_t REGA:5;
      uint64_t PHYA:5;
      uint64_t OP:2;
      uint64_t CLTTO:1;
      uint64_t WZO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RPQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPB1ADR:12;
      uint64_t reservedSpace0:19;
      uint64_t ENTXP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPSF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPB1ADR:12;
      uint64_t reservedSpace0:19;
      uint64_t ENRXP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RPSF;

