iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
};

#define ISI_1 (*(volatile struct ISI_1_tag *) 0xf0034000)

struct LCDC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKPOL:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKSEL:1;
      uint64_t CLKPWMSEL:1;
      uint64_t reservedSpace1:4;
      uint64_t CGDISBASE:1;
      uint64_t CGDISOVR1:1;
      uint64_t CGDISOVR2:1;
      uint64_t CGDISHEO:1;
      uint64_t CGDISHCR:1;
      uint64_t CGDISPP:1;
      uint64_t reservedSpace2:2;
      uint64_t CLKDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSPW:6;
      uint64_t reservedSpace0:10;
      uint64_t VSPW:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VFPW:6;
      uint64_t reservedSpace0:10;
      uint64_t VBPW:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFPW:9;
      uint64_t reservedSpace0:7;
      uint64_t HBPW:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPL:11;
      uint64_t reservedSpace0:5;
      uint64_t RPF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSPOL:1;
      uint64_t VSPOL:1;
      uint64_t VSPDLYS:1;
      uint64_t VSPDLYE:1;
      uint64_t DISPPOL:1;
      uint64_t reservedSpace0:1;
      uint64_t DITHER:1;
      uint64_t DISPDLY:1;
      uint64_t MODE:2;
      uint64_t PP:1;
      uint64_t reservedSpace1:1;
      uint64_t VSPSU:1;
      uint64_t VSPHO:1;
      uint64_t reservedSpace2:2;
      uint64_t GUARDTIME:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMPS:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMPOL:1;
      uint64_t reservedSpace1:3;
      uint64_t PWMCVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDCFG6;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKEN:1;
      uint64_t SYNCEN:1;
      uint64_t DISPEN:1;
      uint64_t PWMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIS:1;
      uint64_t SYNCDIS:1;
      uint64_t DISPDIS:1;
      uint64_t PWMDIS:1;
      uint64_t reservedSpace0:4;
      uint64_t CLKRST:1;
      uint64_t SYNCRST:1;
      uint64_t DISPRST:1;
      uint64_t PWMRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSTS:1;
      uint64_t LCDSTS:1;
      uint64_t DISPSTS:1;
      uint64_t PWMSTS:1;
      uint64_t SIPSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFIE:1;
      uint64_t DISIE:1;
      uint64_t DISPIE:1;
      uint64_t reservedSpace0:1;
      uint64_t FIFOERRIE:1;
      uint64_t reservedSpace1:3;
      uint64_t BASEIE:1;
      uint64_t OVR1IE:1;
      uint64_t OVR2IE:1;
      uint64_t HEOIE:1;
      uint64_t HCRIE:1;
      uint64_t PPIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFID:1;
      uint64_t DISID:1;
      uint64_t DISPID:1;
      uint64_t reservedSpace0:1;
      uint64_t FIFOERRID:1;
      uint64_t reservedSpace1:3;
      uint64_t BASEID:1;
      uint64_t OVR1ID:1;
      uint64_t OVR2ID:1;
      uint64_t HEOID:1;
      uint64_t HCRID:1;
      uint64_t PPID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFIM:1;
      uint64_t DISIM:1;
      uint64_t DISPIM:1;
      uint64_t reservedSpace0:1;
      uint64_t FIFOERRIM:1;
      uint64_t reservedSpace1:3;
      uint64_t BASEIM:1;
      uint64_t OVR1IM:1;
      uint64_t OVR2IM:1;
      uint64_t HEOIM:1;
      uint64_t HCRIM:1;
      uint64_t PPIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOF:1;
      uint64_t DIS:1;
      uint64_t DISP:1;
      uint64_t reservedSpace0:1;
      uint64_t FIFOERR:1;
      uint64_t reservedSpace1:3;
      uint64_t BASE:1;
      uint64_t OVR1:1;
      uint64_t OVR2:1;
      uint64_t HEO:1;
      uint64_t HCR:1;
      uint64_t PP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCDISR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASEADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t LFETCH:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASENEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIF:1;
      uint64_t reservedSpace0:3;
      uint64_t BLEN:2;
      uint64_t reservedSpace1:2;
      uint64_t DLBO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLUTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RGBMODE:4;
      uint64_t CLUTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDEF:8;
      uint64_t GDEF:8;
      uint64_t RDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DMA:1;
      uint64_t REP:1;
      uint64_t reservedSpace1:1;
      uint64_t DISCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISCXPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t DISCYPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISCXSIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t DISCYSIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECFG6;

  uint8_t res2[184];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1HEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t LFETCH:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1NEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIF:1;
      uint64_t reservedSpace0:3;
      uint64_t BLEN:2;
      uint64_t reservedSpace1:2;
      uint64_t DLBO:1;
      uint64_t reservedSpace2:3;
      uint64_t ROTDIS:1;
      uint64_t LOCKDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLUTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RGBMODE:4;
      uint64_t CLUTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t YPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t YSIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDEF:8;
      uint64_t GDEF:8;
      uint64_t RDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKEY:8;
      uint64_t GKEY:8;
      uint64_t RKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMASK:8;
      uint64_t GMASK:8;
      uint64_t RMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRKEY:1;
      uint64_t INV:1;
      uint64_t ITER2BL:1;
      uint64_t ITER:1;
      uint64_t REVALPHA:1;
      uint64_t GAEN:1;
      uint64_t LAEN:1;
      uint64_t OVR:1;
      uint64_t DMA:1;
      uint64_t REP:1;
      uint64_t DSTKEY:1;
      uint64_t reservedSpace0:5;
      uint64_t GA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CFG9;

  uint8_t res3[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2HEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t LFETCH:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2NEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t BLEN:2;
      uint64_t reservedSpace1:2;
      uint64_t DLBO:1;
      uint64_t reservedSpace2:3;
      uint64_t ROTDIS:1;
      uint64_t LOCKDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLUTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RGBMODE:4;
      uint64_t CLUTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t YPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t YSIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDEF:8;
      uint64_t GDEF:8;
      uint64_t RDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKEY:8;
      uint64_t GKEY:8;
      uint64_t RKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMASK:8;
      uint64_t GMASK:8;
      uint64_t RMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRKEY:1;
      uint64_t INV:1;
      uint64_t ITER2BL:1;
      uint64_t ITER:1;
      uint64_t REVALPHA:1;
      uint64_t GAEN:1;
      uint64_t LAEN:1;
      uint64_t OVR:1;
      uint64_t DMA:1;
      uint64_t REP:1;
      uint64_t DSTKEY:1;
      uint64_t reservedSpace0:5;
      uint64_t GA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CFG9;

  uint8_t res4[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
      uint64_t reservedSpace1:3;
      uint64_t UDMA:1;
      uint64_t UDSCR:1;
      uint64_t UADD:1;
      uint64_t UDONE:1;
      uint64_t UOVR:1;
      uint64_t reservedSpace2:3;
      uint64_t VDMA:1;
      uint64_t VDSCR:1;
      uint64_t VADD:1;
      uint64_t VDONE:1;
      uint64_t VOVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
      uint64_t reservedSpace1:3;
      uint64_t UDMA:1;
      uint64_t UDSCR:1;
      uint64_t UADD:1;
      uint64_t UDONE:1;
      uint64_t UOVR:1;
      uint64_t reservedSpace2:3;
      uint64_t VDMA:1;
      uint64_t VDSCR:1;
      uint64_t VADD:1;
      uint64_t VDONE:1;
      uint64_t VOVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
      uint64_t reservedSpace1:3;
      uint64_t UDMA:1;
      uint64_t UDSCR:1;
      uint64_t UADD:1;
      uint64_t UDONE:1;
      uint64_t UOVR:1;
      uint64_t reservedSpace2:3;
      uint64_t VDMA:1;
      uint64_t VDSCR:1;
      uint64_t VADD:1;
      uint64_t VDONE:1;
      uint64_t VOVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
      uint64_t reservedSpace1:3;
      uint64_t UDMA:1;
      uint64_t UDSCR:1;
      uint64_t UADD:1;
      uint64_t UDONE:1;
      uint64_t UOVR:1;
      uint64_t reservedSpace2:3;
      uint64_t VDMA:1;
      uint64_t VDSCR:1;
      uint64_t VADD:1;
      uint64_t VDONE:1;
      uint64_t VOVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t LFETCH:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEONEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UHEAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOUHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOUADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UDFETCH:1;
      uint64_t reservedSpace0:1;
      uint64_t UDMAIEN:1;
      uint64_t UDSCRIEN:1;
      uint64_t UADDIEN:1;
      uint64_t UDONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOUCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOUNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VHEAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOVHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOVADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VDFETCH:1;
      uint64_t reservedSpace0:1;
      uint64_t VDMAIEN:1;
      uint64_t VDSCRIEN:1;
      uint64_t VADDIEN:1;
      uint64_t VDONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOVCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VNEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOVNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIF:1;
      uint64_t reservedSpace0:3;
      uint64_t BLEN:2;
      uint64_t BLENUV:2;
      uint64_t DLBO:1;
      uint64_t reservedSpace1:3;
      uint64_t ROTDIS:1;
      uint64_t LOCKDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLUTEN:1;
      uint64_t YUVEN:1;
      uint64_t reservedSpace0:2;
      uint64_t RGBMODE:4;
      uint64_t CLUTMODE:2;
      uint64_t reservedSpace1:2;
      uint64_t YUVMODE:4;
      uint64_t YUV422ROT:1;
      uint64_t YUV422SWP:1;
      uint64_t reservedSpace2:2;
      uint64_t DSCALEOPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t YPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCFG2;

