iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t LFETCH:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIF:1;
      uint64_t reservedSpace0:3;
      uint64_t BLEN:2;
      uint64_t reservedSpace1:2;
      uint64_t DLBO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLUTEN:1;
      uint64_t reservedSpace0:3;
      uint64_t RGBMODE:4;
      uint64_t CLUTMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPOS:11;
      uint64_t reservedSpace0:5;
      uint64_t YPOS:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSIZE:11;
      uint64_t reservedSpace0:5;
      uint64_t YSIZE:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG4;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDEF:8;
      uint64_t GDEF:8;
      uint64_t RDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKEY:8;
      uint64_t GKEY:8;
      uint64_t RKEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMASK:8;
      uint64_t GMASK:8;
      uint64_t RMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRKEY:1;
      uint64_t INV:1;
      uint64_t ITER2BL:1;
      uint64_t ITER:1;
      uint64_t REVALPHA:1;
      uint64_t GAEN:1;
      uint64_t LAEN:1;
      uint64_t OVR:1;
      uint64_t DMA:1;
      uint64_t REP:1;
      uint64_t DSTKEY:1;
      uint64_t reservedSpace0:5;
      uint64_t GA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCFG9;

  uint8_t res7[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHEN:1;
      uint64_t UPDATEEN:1;
      uint64_t A2QEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHDIS:1;
      uint64_t reservedSpace0:7;
      uint64_t CHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSR:1;
      uint64_t UPDATESR:1;
      uint64_t A2QSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DMA:1;
      uint64_t DSCR:1;
      uint64_t ADD:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HEAD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPHEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFETCH:1;
      uint64_t reservedSpace0:1;
      uint64_t DMAIEN:1;
      uint64_t DSCRIEN:1;
      uint64_t ADDIEN:1;
      uint64_t DONEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEXT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIF:1;
      uint64_t reservedSpace0:3;
      uint64_t BLEN:2;
      uint64_t reservedSpace1:2;
      uint64_t DLBO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPMODE:3;
      uint64_t reservedSpace0:1;
      uint64_t ITUBT601:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSTRIDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCYR:10;
      uint64_t CSCYG:10;
      uint64_t CSCYB:10;
      uint64_t CSCYOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCUR:10;
      uint64_t CSCUG:10;
      uint64_t CSCUB:10;
      uint64_t CSCUOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCVR:10;
      uint64_t CSCVG:10;
      uint64_t CSCVB:10;
      uint64_t CSCVOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPCFG5;

  uint8_t res8[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCLUT:8;
      uint64_t GCLUT:8;
      uint64_t RCLUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BASECLUT;

  uint8_t res9[1020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCLUT:8;
      uint64_t GCLUT:8;
      uint64_t RCLUT:8;
      uint64_t ACLUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR1CLUT;

