iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res10[1020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCLUT:8;
      uint64_t GCLUT:8;
      uint64_t RCLUT:8;
      uint64_t ACLUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVR2CLUT;

  uint8_t res11[1020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCLUT:8;
      uint64_t GCLUT:8;
      uint64_t RCLUT:8;
      uint64_t ACLUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HEOCLUT;

  uint8_t res12[1020];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCLUT:8;
      uint64_t GCLUT:8;
      uint64_t RCLUT:8;
      uint64_t ACLUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCRCLUT;

};

#define LCDC_1 (*(volatile struct LCDC_1_tag *) 0xf0030000)

struct MATRIX_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCFG;

  uint8_t res0[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFG;

  uint8_t res1[60];

  uint32_t PRAS0;
  uint32_t PRBS0;
  uint32_t PRAS1;
  uint32_t PRBS1;
  uint32_t PRAS2;
  uint32_t PRBS2;
  uint32_t PRAS3;
  uint32_t PRBS3;
  uint32_t PRAS4;
  uint32_t PRBS4;
  uint32_t PRAS5;
  uint32_t PRBS5;
  uint32_t PRAS6;
  uint32_t PRBS6;
  uint32_t PRAS7;
  uint32_t PRBS7;
  uint32_t PRAS8;
  uint32_t PRBS8;
  uint32_t PRAS9;
  uint32_t PRBS9;
  uint32_t PRAS10;
  uint32_t PRBS10;
  uint32_t PRAS11;
  uint32_t PRBS11;
  uint32_t PRAS12;
  uint32_t PRBS12;
  uint32_t PRAS13;
  uint32_t PRBS13;
  uint32_t PRAS14;
  uint32_t PRBS14;
  uint32_t PRAS15;
  uint32_t PRBS15;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCB0:1;
      uint64_t RCB1:1;
      uint64_t RCB2:1;
      uint64_t RCB3:1;
      uint64_t RCB4:1;
      uint64_t RCB5:1;
      uint64_t RCB6:1;
      uint64_t RCB7:1;
      uint64_t RCB8:1;
      uint64_t RCB9:1;
      uint64_t RCB10:1;
      uint64_t RCB11:1;
      uint64_t RCB12:1;
      uint64_t RCB13:1;
      uint64_t RCB14:1;
      uint64_t RCB15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRCR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  uint8_t res3[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

};

#define MATRIX_1 (*(volatile struct MATRIX_1_tag *) 0xffffec00)

struct MPDDRC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:3;
      uint64_t reservedSpace0:5;
      uint64_t MRS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:12;
      uint64_t reservedSpace0:4;
      uint64_t ADJ_REF:1;
      uint64_t REF_PB:1;
      uint64_t reservedSpace1:2;
      uint64_t MR4_VALUE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NC:2;
      uint64_t NR:2;
      uint64_t CAS:3;
      uint64_t DLL:1;
      uint64_t DIC_DS:1;
      uint64_t DIS_DLL:1;
      uint64_t ZQ:2;
      uint64_t OCD:3;
      uint64_t reservedSpace0:1;
      uint64_t DQMS:1;
      uint64_t ENRDM:1;
      uint64_t reservedSpace1:2;
      uint64_t NB:1;
      uint64_t NDQS:1;
      uint64_t DECOD:1;
      uint64_t UNAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRAS:4;
      uint64_t TRCD:4;
      uint64_t TWR:4;
      uint64_t TRC:4;
      uint64_t TRP:4;
      uint64_t TRRD:4;
      uint64_t TWTR:4;
      uint64_t TMRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRFC:5;
      uint64_t reservedSpace0:3;
      uint64_t TXSNR:8;
      uint64_t TXSRD:8;
      uint64_t TXP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXARD:4;
      uint64_t TXARDS:4;
      uint64_t TRPA:4;
      uint64_t TRTP:3;
      uint64_t reservedSpace0:1;
      uint64_t TFAW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPCB:2;
      uint64_t CLK_FR:1;
      uint64_t LPDDR2_PWOFF:1;
      uint64_t PASR:3;
      uint64_t reservedSpace0:1;
      uint64_t DS:3;
      uint64_t reservedSpace1:1;
      uint64_t TIMEOUT:2;
      uint64_t reservedSpace2:2;
      uint64_t APDE:1;
      uint64_t reservedSpace3:3;
      uint64_t UPD_MR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:3;
      uint64_t reservedSpace0:1;
      uint64_t DBW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MD;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BK_MASK:8;
      uint64_t SEG_MASK:16;
      uint64_t DS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPDDR2_LPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_CAL:16;
      uint64_t MR4_READ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPDDR2_CAL_MR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ZQCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPDDR2_TIM_CAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDIV:3;
      uint64_t reservedSpace0:5;
      uint64_t TZQIO:3;
      uint64_t reservedSpace1:5;
      uint64_t CALCODEP:4;
      uint64_t CALCODEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IO_CALIBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCR_EN:1;
      uint64_t KEY1_KEY1:32;
      uint64_t KEY2_KEY2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMS_KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMS_KEY2;

