iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res12[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE0:2;
      uint64_t LINE1:2;
      uint64_t LINE2:2;
      uint64_t LINE3:2;
      uint64_t LINE4:2;
      uint64_t LINE5:2;
      uint64_t LINE6:2;
      uint64_t LINE7:2;
      uint64_t LINE8:2;
      uint64_t LINE9:2;
      uint64_t LINE10:2;
      uint64_t LINE11:2;
      uint64_t LINE12:2;
      uint64_t LINE13:2;
      uint64_t LINE14:2;
      uint64_t LINE15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRIVER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE16:2;
      uint64_t LINE17:2;
      uint64_t LINE18:2;
      uint64_t LINE19:2;
      uint64_t LINE20:2;
      uint64_t LINE21:2;
      uint64_t LINE22:2;
      uint64_t LINE23:2;
      uint64_t LINE24:2;
      uint64_t LINE25:2;
      uint64_t LINE26:2;
      uint64_t LINE27:2;
      uint64_t LINE28:2;
      uint64_t LINE29:2;
      uint64_t LINE30:2;
      uint64_t LINE31:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRIVER2;

};

#define PIO_PIOE_1 (*(volatile struct PIO_PIOE_1_tag *) 0xfffffa00)

struct PIT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIV:20;
      uint64_t reservedSpace0:4;
      uint64_t PITEN:1;
      uint64_t PITIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PITS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPIV:20;
      uint64_t PICNT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPIV:20;
      uint64_t PICNT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIIR;

};

#define PIT_1 (*(volatile struct PIT_1_tag *) 0xfffffe30)

struct PMC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DDRCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SMDCK:1;
      uint64_t reservedSpace2:1;
      uint64_t UHP:1;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCK:1;
      uint64_t reservedSpace0:1;
      uint64_t DDRCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SMDCK:1;
      uint64_t reservedSpace2:1;
      uint64_t UHP:1;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCK:1;
      uint64_t reservedSpace0:1;
      uint64_t DDRCK:1;
      uint64_t reservedSpace1:1;
      uint64_t SMDCK:1;
      uint64_t reservedSpace2:1;
      uint64_t UHP:1;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PID2:1;
      uint64_t PID3:1;
      uint64_t PID4:1;
      uint64_t PID5:1;
      uint64_t PID6:1;
      uint64_t PID7:1;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PID2:1;
      uint64_t PID3:1;
      uint64_t PID4:1;
      uint64_t PID5:1;
      uint64_t PID6:1;
      uint64_t PID7:1;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PID2:1;
      uint64_t PID3:1;
      uint64_t PID4:1;
      uint64_t PID5:1;
      uint64_t PID6:1;
      uint64_t PID7:1;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t PID16:1;
      uint64_t PID17:1;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSR0;

  uint32_t R_UCKR;
  uint32_t R_MOR;
  uint32_t R_MCFR;
  uint32_t R_PLLAR;
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:2;
      uint64_t reservedSpace0:2;
      uint64_t PRES:3;
      uint64_t reservedSpace1:1;
      uint64_t MDIV:2;
      uint64_t reservedSpace2:2;
      uint64_t PLLADIV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCKR;

