iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint32_t CMPV0;
  uint32_t CMPVUPD0;
  uint32_t CMPM0;
  uint32_t CMPMUPD0;
  uint32_t CMPV1;
  uint32_t CMPVUPD1;
  uint32_t CMPM1;
  uint32_t CMPMUPD1;
  uint32_t CMPV2;
  uint32_t CMPVUPD2;
  uint32_t CMPM2;
  uint32_t CMPMUPD2;
  uint32_t CMPV3;
  uint32_t CMPVUPD3;
  uint32_t CMPM3;
  uint32_t CMPMUPD3;
  uint32_t CMPV4;
  uint32_t CMPVUPD4;
  uint32_t CMPM4;
  uint32_t CMPMUPD4;
  uint32_t CMPV5;
  uint32_t CMPVUPD5;
  uint32_t CMPM5;
  uint32_t CMPMUPD5;
  uint32_t CMPV6;
  uint32_t CMPVUPD6;
  uint32_t CMPM6;
  uint32_t CMPMUPD6;
  uint32_t CMPV7;
  uint32_t CMPVUPD7;
  uint32_t CMPM7;
  uint32_t CMPMUPD7;
  uint8_t res5[80];

  uint32_t CMR0;
  uint32_t CDTY0;
  uint32_t CDTYUPD0;
  uint32_t CPRD0;
  uint32_t CPRDUPD0;
  uint32_t CCNT0;
  uint32_t DT0;
  uint32_t DTUPD0;
  uint32_t CMR1;
  uint32_t CDTY1;
  uint32_t CDTYUPD1;
  uint32_t CPRD1;
  uint32_t CPRDUPD1;
  uint32_t CCNT1;
  uint32_t DT1;
  uint32_t DTUPD1;
  uint32_t CMR2;
  uint32_t CDTY2;
  uint32_t CDTYUPD2;
  uint32_t CPRD2;
  uint32_t CPRDUPD2;
  uint32_t CCNT2;
  uint32_t DT2;
  uint32_t DTUPD2;
  uint32_t CMR3;
  uint32_t CDTY3;
  uint32_t CDTYUPD3;
  uint32_t CPRD3;
  uint32_t CPRDUPD3;
  uint32_t CCNT3;
  uint32_t DT3;
  uint32_t DTUPD3;
  uint8_t res6[384];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t CPOLUP:1;
      uint64_t reservedSpace1:3;
      uint64_t CPOLINVUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMUPD0;

  uint8_t res7[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t CPOLUP:1;
      uint64_t reservedSpace1:3;
      uint64_t CPOLINVUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMUPD1;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t CPOLUP:1;
      uint64_t reservedSpace1:3;
      uint64_t CPOLINVUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMUPD2;

  uint8_t res9[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t CPOLUP:1;
      uint64_t reservedSpace1:3;
      uint64_t CPOLINVUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMUPD3;

};

#define PWM_1 (*(volatile struct PWM_1_tag *) 0xf002c000)

struct RSTC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCRST:1;
      uint64_t reservedSpace0:1;
      uint64_t PERRST:1;
      uint64_t EXTRST:1;
      uint64_t reservedSpace1:20;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t URSTS:1;
      uint64_t reservedSpace0:7;
      uint64_t RSTTYP:3;
      uint64_t reservedSpace1:5;
      uint64_t NRSTL:1;
      uint64_t SRCMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ERSTL:4;
      uint64_t reservedSpace1:12;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

};

#define RSTC_1 (*(volatile struct RSTC_1_tag *) 0xfffffe00)

struct RTC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPDTIM:1;
      uint64_t UPDCAL:1;
      uint64_t reservedSpace0:6;
      uint64_t TIMEVSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t CALEVSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:7;
      uint64_t reservedSpace0:1;
      uint64_t MIN:7;
      uint64_t reservedSpace1:1;
      uint64_t HOUR:6;
      uint64_t AMPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENT:7;
      uint64_t reservedSpace0:1;
      uint64_t YEAR:8;
      uint64_t MONTH:5;
      uint64_t DAY:3;
      uint64_t DATE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC:7;
      uint64_t SECEN:1;
      uint64_t MIN:7;
      uint64_t MINEN:1;
      uint64_t HOUR:6;
      uint64_t AMPM:1;
      uint64_t HOUREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t MONTH:5;
      uint64_t reservedSpace1:2;
      uint64_t MTHEN:1;
      uint64_t DATE:6;
      uint64_t reservedSpace2:1;
      uint64_t DATEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKUPD:1;
      uint64_t ALARM:1;
      uint64_t SEC:1;
      uint64_t TIMEV:1;
      uint64_t CALEV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKCLR:1;
      uint64_t ALRCLR:1;
      uint64_t SECCLR:1;
      uint64_t TIMCLR:1;
      uint64_t CALCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKEN:1;
      uint64_t ALREN:1;
      uint64_t SECEN:1;
      uint64_t TIMEN:1;
      uint64_t CALEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKDIS:1;
      uint64_t ALRDIS:1;
      uint64_t SECDIS:1;
      uint64_t TIMDIS:1;
      uint64_t CALDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK:1;
      uint64_t ALR:1;
      uint64_t SEC:1;
      uint64_t TIM:1;
      uint64_t CAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NVTIM:1;
      uint64_t NVCAL:1;
      uint64_t NVTIMALR:1;
      uint64_t NVCALALR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VER;

