iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RC0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RC1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
      uint64_t reservedSpace2:4;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace0:2;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t reservedSpace1:2;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  uint8_t res2[148];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPSR;

};

#define SSC_SSC1_1 (*(volatile struct SSC_SSC1_1_tag *) 0xf800c000)

struct TC_TC0_1_tag
{
  uint32_t CCR0;
  uint32_t CMR0;
  uint8_t res0[4];

  uint32_t RAB0;
  uint32_t CV0;
  uint32_t RA0;
  uint32_t RB0;
  uint32_t RC0;
  uint32_t SR0;
  uint32_t IER0;
  uint32_t IDR0;
  uint32_t IMR0;
  uint8_t res1[16];

  uint32_t CCR1;
  uint32_t CMR1;
  uint8_t res2[4];

  uint32_t RAB1;
  uint32_t CV1;
  uint32_t RA1;
  uint32_t RB1;
  uint32_t RC1;
  uint32_t SR1;
  uint32_t IER1;
  uint32_t IDR1;
  uint32_t IMR1;
  uint8_t res3[16];

  uint32_t CCR2;
  uint32_t CMR2;
  uint8_t res4[4];

  uint32_t RAB2;
  uint32_t CV2;
  uint32_t RA2;
  uint32_t RB2;
  uint32_t RC2;
  uint32_t SR2;
  uint32_t IER2;
  uint32_t IDR2;
  uint32_t IMR2;
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC0XC0S:2;
      uint64_t TC1XC1S:2;
      uint64_t TC2XC2S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMR;

};

#define TC_TC0_1 (*(volatile struct TC_TC0_1_tag *) 0xf0010000)

struct TC_TC1_1_tag
{
  uint32_t CCR0;
  uint32_t CMR0;
  uint8_t res0[4];

  uint32_t RAB0;
  uint32_t CV0;
  uint32_t RA0;
  uint32_t RB0;
  uint32_t RC0;
  uint32_t SR0;
  uint32_t IER0;
  uint32_t IDR0;
  uint32_t IMR0;
  uint8_t res1[16];

  uint32_t CCR1;
  uint32_t CMR1;
  uint8_t res2[4];

  uint32_t RAB1;
  uint32_t CV1;
  uint32_t RA1;
  uint32_t RB1;
  uint32_t RC1;
  uint32_t SR1;
  uint32_t IER1;
  uint32_t IDR1;
  uint32_t IMR1;
  uint8_t res3[16];

  uint32_t CCR2;
  uint32_t CMR2;
  uint8_t res4[4];

  uint32_t RAB2;
  uint32_t CV2;
  uint32_t RA2;
  uint32_t RB2;
  uint32_t RC2;
  uint32_t SR2;
  uint32_t IER2;
  uint32_t IDR2;
  uint32_t IMR2;
  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC0XC0S:2;
      uint64_t TC1XC1S:2;
      uint64_t TC2XC2S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BMR;

};

#define TC_TC1_1 (*(volatile struct TC_TC1_1_tag *) 0xf8014000)

struct TDES_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t reservedSpace0:7;
      uint64_t SWRST:1;
      uint64_t reservedSpace1:7;
      uint64_t LOADSEED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIPHER:1;
      uint64_t TDESMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t KEYMOD:1;
      uint64_t reservedSpace1:3;
      uint64_t SMOD:2;
      uint64_t reservedSpace2:2;
      uint64_t OPMOD:2;
      uint64_t reservedSpace3:1;
      uint64_t LOD:1;
      uint64_t CFBS:2;
      uint64_t reservedSpace4:2;
      uint64_t CKEY:4;
      uint64_t CMTYP1:1;
      uint64_t CMTYP2:1;
      uint64_t CMTYP3:1;
      uint64_t CMTYP4:1;
      uint64_t CMTYP5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATRDY:1;
      uint64_t reservedSpace0:7;
      uint64_t URAD:1;
      uint64_t reservedSpace1:3;
      uint64_t URAT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY1W:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEY1WR;

