iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/ATSAMA5D3x/targetInit/SAMA5D3x_sfr.h
  uint8_t res3[4];

  uint32_t EPTCFG0;
  uint32_t EPTCTLENB0;
  uint32_t EPTCTLDIS0;
  uint32_t EPTCTL0;
  uint8_t res4[4];

  uint32_t EPTSETSTA0;
  uint32_t EPTCLRSTA0;
  uint32_t EPTSTA0;
  uint32_t EPTCFG1;
  uint32_t EPTCTLENB1;
  uint32_t EPTCTLDIS1;
  uint32_t EPTCTL1;
  uint8_t res5[4];

  uint32_t EPTSETSTA1;
  uint32_t EPTCLRSTA1;
  uint32_t EPTSTA1;
  uint32_t EPTCFG2;
  uint32_t EPTCTLENB2;
  uint32_t EPTCTLDIS2;
  uint32_t EPTCTL2;
  uint8_t res6[4];

  uint32_t EPTSETSTA2;
  uint32_t EPTCLRSTA2;
  uint32_t EPTSTA2;
  uint32_t EPTCFG3;
  uint32_t EPTCTLENB3;
  uint32_t EPTCTLDIS3;
  uint32_t EPTCTL3;
  uint8_t res7[4];

  uint32_t EPTSETSTA3;
  uint32_t EPTCLRSTA3;
  uint32_t EPTSTA3;
  uint32_t EPTCFG4;
  uint32_t EPTCTLENB4;
  uint32_t EPTCTLDIS4;
  uint32_t EPTCTL4;
  uint8_t res8[4];

  uint32_t EPTSETSTA4;
  uint32_t EPTCLRSTA4;
  uint32_t EPTSTA4;
  uint32_t EPTCFG5;
  uint32_t EPTCTLENB5;
  uint32_t EPTCTLDIS5;
  uint32_t EPTCTL5;
  uint8_t res9[4];

  uint32_t EPTSETSTA5;
  uint32_t EPTCLRSTA5;
  uint32_t EPTSTA5;
  uint32_t EPTCFG6;
  uint32_t EPTCTLENB6;
  uint32_t EPTCTLDIS6;
  uint32_t EPTCTL6;
  uint8_t res10[4];

  uint32_t EPTSETSTA6;
  uint32_t EPTCLRSTA6;
  uint32_t EPTSTA6;
  uint32_t EPTCFG7;
  uint32_t EPTCTLENB7;
  uint32_t EPTCTLDIS7;
  uint32_t EPTCTL7;
  uint8_t res11[4];

  uint32_t EPTSETSTA7;
  uint32_t EPTCLRSTA7;
  uint32_t EPTSTA7;
  uint32_t EPTCFG8;
  uint32_t EPTCTLENB8;
  uint32_t EPTCTLDIS8;
  uint32_t EPTCTL8;
  uint8_t res12[4];

  uint32_t EPTSETSTA8;
  uint32_t EPTCLRSTA8;
  uint32_t EPTSTA8;
  uint32_t EPTCFG9;
  uint32_t EPTCTLENB9;
  uint32_t EPTCTLDIS9;
  uint32_t EPTCTL9;
  uint8_t res13[4];

  uint32_t EPTSETSTA9;
  uint32_t EPTCLRSTA9;
  uint32_t EPTSTA9;
  uint32_t EPTCFG10;
  uint32_t EPTCTLENB10;
  uint32_t EPTCTLDIS10;
  uint32_t EPTCTL10;
  uint8_t res14[4];

  uint32_t EPTSETSTA10;
  uint32_t EPTCLRSTA10;
  uint32_t EPTSTA10;
  uint32_t EPTCFG11;
  uint32_t EPTCTLENB11;
  uint32_t EPTCTLDIS11;
  uint32_t EPTCTL11;
  uint8_t res15[4];

  uint32_t EPTSETSTA11;
  uint32_t EPTCLRSTA11;
  uint32_t EPTSTA11;
  uint32_t EPTCFG12;
  uint32_t EPTCTLENB12;
  uint32_t EPTCTLDIS12;
  uint32_t EPTCTL12;
  uint8_t res16[4];

  uint32_t EPTSETSTA12;
  uint32_t EPTCLRSTA12;
  uint32_t EPTSTA12;
  uint32_t EPTCFG13;
  uint32_t EPTCTLENB13;
  uint32_t EPTCTLDIS13;
  uint32_t EPTCTL13;
  uint8_t res17[4];

  uint32_t EPTSETSTA13;
  uint32_t EPTCLRSTA13;
  uint32_t EPTSTA13;
  uint32_t EPTCFG14;
  uint32_t EPTCTLENB14;
  uint32_t EPTCTLDIS14;
  uint32_t EPTCTL14;
  uint8_t res18[4];

  uint32_t EPTSETSTA14;
  uint32_t EPTCLRSTA14;
  uint32_t EPTSTA14;
  uint32_t EPTCFG15;
  uint32_t EPTCTLENB15;
  uint32_t EPTCTLDIS15;
  uint32_t EPTCTL15;
  uint8_t res19[4];

  uint32_t EPTSETSTA15;
  uint32_t EPTCLRSTA15;
  uint32_t EPTSTA15;
  uint32_t DMANXTDSC0;
  uint32_t DMAADDRESS0;
  uint32_t DMACONTROL0;
  uint32_t DMASTATUS0;
  uint32_t DMANXTDSC1;
  uint32_t DMAADDRESS1;
  uint32_t DMACONTROL1;
  uint32_t DMASTATUS1;
  uint32_t DMANXTDSC2;
  uint32_t DMAADDRESS2;
  uint32_t DMACONTROL2;
  uint32_t DMASTATUS2;
  uint32_t DMANXTDSC3;
  uint32_t DMAADDRESS3;
  uint32_t DMACONTROL3;
  uint32_t DMASTATUS3;
  uint32_t DMANXTDSC4;
  uint32_t DMAADDRESS4;
  uint32_t DMACONTROL4;
  uint32_t DMASTATUS4;
  uint32_t DMANXTDSC5;
  uint32_t DMAADDRESS5;
  uint32_t DMACONTROL5;
  uint32_t DMASTATUS5;
  uint32_t DMANXTDSC6;
  uint32_t DMAADDRESS6;
  uint32_t DMACONTROL6;
  uint32_t DMASTATUS6;
};

#define UDPHS_1 (*(volatile struct UDPHS_1_tag *) 0xf8030000)

struct USART_USART0_1_tag
{
  uint32_t CR;
  uint32_t MR;
  uint32_t IER;
  uint32_t IDR;
  uint32_t IMR;
  uint32_t CSR;
  uint32_t RHR;
  uint32_t THR;
  uint32_t BRGR;
  uint32_t RTOR;
  uint32_t TTGR;
  uint8_t res0[20];

  uint32_t FIDI;
  uint32_t NER;
  uint8_t res1[4];

  uint32_t IF;
  uint32_t MAN;
  uint8_t res2[144];

  uint32_t WPMR;
  uint32_t WPSR;
};

#define USART_USART0_1 (*(volatile struct USART_USART0_1_tag *) 0xf001c000)

struct USART_USART1_1_tag
{
  uint32_t CR;
  uint32_t MR;
  uint32_t IER;
  uint32_t IDR;
  uint32_t IMR;
  uint32_t CSR;
  uint32_t RHR;
  uint32_t THR;
  uint32_t BRGR;
  uint32_t RTOR;
  uint32_t TTGR;
  uint8_t res0[20];

  uint32_t FIDI;
  uint32_t NER;
  uint8_t res1[4];

  uint32_t IF;
  uint32_t MAN;
  uint8_t res2[144];

  uint32_t WPMR;
  uint32_t WPSR;
};

#define USART_USART1_1 (*(volatile struct USART_USART1_1_tag *) 0xf0020000)

struct USART_USART2_1_tag
{
  uint32_t CR;
  uint32_t MR;
  uint32_t IER;
  uint32_t IDR;
  uint32_t IMR;
  uint32_t CSR;
  uint32_t RHR;
  uint32_t THR;
  uint32_t BRGR;
  uint32_t RTOR;
  uint32_t TTGR;
  uint8_t res0[20];

  uint32_t FIDI;
  uint32_t NER;
  uint8_t res1[4];

  uint32_t IF;
  uint32_t MAN;
  uint8_t res2[144];

  uint32_t WPMR;
  uint32_t WPSR;
};

#define USART_USART2_1 (*(volatile struct USART_USART2_1_tag *) 0xf8020000)

struct USART_USART3_1_tag
{
  uint32_t CR;
  uint32_t MR;
  uint32_t IER;
  uint32_t IDR;
  uint32_t IMR;
  uint32_t CSR;
  uint32_t RHR;
  uint32_t THR;
  uint32_t BRGR;
  uint32_t RTOR;
  uint32_t TTGR;
  uint8_t res0[20];

  uint32_t FIDI;
  uint32_t NER;
  uint8_t res1[4];

  uint32_t IF;
  uint32_t MAN;
  uint8_t res2[144];

  uint32_t WPMR;
  uint32_t WPSR;
};

#define USART_USART3_1 (*(volatile struct USART_USART3_1_tag *) 0xf8024000)

struct WDT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDRSTT:1;
      uint64_t reservedSpace0:23;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDV:12;
      uint64_t WDFIEN:1;
      uint64_t WDRSTEN:1;
      uint64_t WDRPROC:1;
      uint64_t WDDIS:1;
      uint64_t WDD:12;
      uint64_t WDDBGHLT:1;
      uint64_t WDIDLEHLT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDUNF:1;
      uint64_t WDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define WDT_1 (*(volatile struct WDT_1_tag *) 0xfffffe40)

